
-- ====================== 文件信息 ======================

-- 剑侠情缘online 情义江湖同伴剧情脚本实体处理文件 - 隐藏任务 - 异族武士对话
-- Edited by peres
-- 2005/09/09 PM 11:19

-- 只有他和她两个人
-- 他们相爱
-- 她记得
-- 他的手抚摩在她的皮肤上的温情
-- 他的亲吻像鸟群在天空掠过
-- 他在她身体里面的暴戾和放纵
-- 他入睡时候的样子充满纯真
-- 她记得，清晨她醒过来的一刻，他在她的身边
-- 她睁着眼睛，看曙光透过窗帘一点一点地照射进来
-- 她的心里因为幸福而疼痛

-- ======================================================

-- 各个级别的同伴剧情任务实体处理文件
Include ("\\script\\task\\partner\\master\\partner_master_main_05.lua");


function main()
	
	SelectDescribe({"<npc>大人请到的那几个高手武功都高得吓人哪。有他们在，就是袭杀大宋的皇帝都不是难事。抓住那个叫<color=yellow>王一<color>的南蛮子还不是手到擒来？",
					"结束对话/OnTaskExit"
					});	
	return
	
end;