TSKI_DAILY_COUNT		= 3064
MAX_DAILY_COUNT		= 3
MOSTER_POS		= {{200, 1660, 3216}, {200, 1667, 3219}, {200, 1666, 3229}, {200, 1678, 3227}, {200, 1689, 3239}, {200, 1700, 3256}, {200, 1698, 3264}, {200, 1710, 3272}, {200, 1722, 3277}, {200, 1733, 3285}, {200, 1740, 3294}, {200, 1743, 3304}, 
								{200, 1748, 3313}, {200, 1754, 3316}, {200, 1761, 3320}, {200, 1768, 3331}, {200, 1775, 3304}, {200, 1777, 3351}, {200, 1769, 3345}, {200, 1782, 3353}, {200, 1778, 3358}, {200, 1758, 3331},}
nIdx_LAST_USE_TIME		= {4,5,6,7}
EVENT_LOG_TITLE		= "NhiemVuHoTieu"
szLEVEL_TIP		= "Yªu cÇu ®¼ng cÊp ph¶i ®¹t ®Õn cÊp<color=yellow>150<color> hoÆc lµ ®· trïng sinh."
szCAMP_TIP		= "Ng­êi ch¬i tªn ch÷ tr¾ng kh«ng thÓ tham gia ho¹t ®éng nµy"
