Include("\\script\\task\\newtask\\newtask_head.lua")
Include("\\script\\task\\newtask\\branch\\zhongli\\branch_zhonglitasknpc.lua")

function main()
	Uworld42 = GetTask(42)
	Uworld1057 = nt_getTask(1057)
		branch_longzhuiwu()
	--elseif (Uworld42 == 50) then
		--Talk(12,"","龙追舞：不必说了，我什么都知道……小兄弟，三十年前中原曾经有四个武人，朋友们客气称为“武林四奇”你可曾听说？","玩家：在下出道甚晚，不太清楚。","龙追舞：江山代有才人出，这不怪你。四人中我是老幺，使屠龙抢法。跛子与和尚是武当、少林高手。而我们的老大沧浪客，一手“奔流一握”绝技，当时罕逢敌手。当年我等追随岳元帅讨伐金贼，十荡十绝，纵横天下那是何等的快意。","玩家：原来前辈曾是武穆帐中将领，失敬失敬。","龙追舞：哼，有什么好敬佩的。皇上十三道金牌令箭招杀元帅于风波亭，我等也被秦侩手下高手追袭。老大最惨，一门英烈尽丧此役。可惜他那时已年逾古昔，落得孑然一身的悲凉收场。","玩家：于是你们看透世事，各奔东西？","龙追舞：……如今老大已半疯半癫，整日抓着别家小子当自己儿孙……不知道的人拿些烂菜叶子糟糠扔他，他也不躲。人不似人了……","玩家：莫非掠去小儿的便是沧浪客前辈？","龙追舞：正是。他为庆自己的九十寿辰，掳些孩子扮做自己儿孙，并无伤害他们的意思。你此去寻人，切不可伤了我家老大姓命。","玩家：龙大侠说笑了，在下几手三角猫工夫，怎能与沧浪客前辈相比。","龙追舞：阁下过谦了，我见你神光内敛，顶额高突，分明是一家高手。老大那日因伤心过度导致走火入魔，功力实已损失泰半。他如今在点苍山中隐居。你这就去吧。","玩家：谢过谢辈。")
		--SetTask(42,60)
		--AddNote("接到任务:去点苍山找沧浪客询问小孩失踪的消息.")
		--Msg2Player("接到任务:去点苍山找沧浪客询问小孩失踪的消息.")
	--elseif (Uworld42 >= 60) then
		--Talk(1,"","龙追舞：你没有伤害我大哥吧？")
	--else
		--Talk(1,"","龙追舞：三十载寒暑…………难道真的没有希望了？")
	--end
end;




