--Create by yfeng 2004-3-15
--这里是各个boss可能出现的地点的列表

where={
	zhangzongzheng=
	{
		22,--西南北区\青城山\白云洞迷宫
		23,--西南北区\青城山\神仙洞迷宫
		4,--西北南区\剑阁西北\金光洞迷宫
		5,--西北南区\剑阁西北\经皇洞迷宫
		6,--西北南区\剑阁西北\锁云洞迷宫
		42,--中原北区\伏牛山\天心洞迷宫
		91,--中原南区\伏牛山\鸡冠洞迷宫
		71,--两湖区\武陵山\白水洞迷宫
		73,--两湖区\武陵山\伏流洞迷宫
		94,--中原南区\蜀冈山\灵谷洞密宫
		194,--江南区\武夷山\玉华洞迷宫
		180,--江南区\罗霄山\龙宫洞迷宫
		182 --江南区\罗霄山\孽龙洞迷宫
	},
	miaoru=
	{
		22,--西南北区\青城山\白云洞迷宫
		23,--西南北区\青城山\神仙洞迷宫
		4,--西北南区\剑阁西北\金光洞迷宫
		5,--西北南区\剑阁西北\经皇洞迷宫
		6,--西北南区\剑阁西北\锁云洞迷宫
		42,--中原北区\伏牛山\天心洞迷宫
		91,--中原南区\伏牛山\鸡冠洞迷宫
		71,--两湖区\武陵山\白水洞迷宫
		73,--两湖区\武陵山\伏流洞迷宫
		94,--中原南区\蜀冈山\灵谷洞密宫
		194,--江南区\武夷山\玉华洞迷宫
		180,--江南区\罗霄山\龙宫洞迷宫
		182 --江南区\罗霄山\孽龙洞迷宫
	},
	liuqingqing=
	{
		22,--西南北区\青城山\白云洞迷宫
		23,--西南北区\青城山\神仙洞迷宫
		4,--西北南区\剑阁西北\金光洞迷宫
		5,--西北南区\剑阁西北\经皇洞迷宫
		6,--西北南区\剑阁西北\锁云洞迷宫
		42,--中原北区\伏牛山\天心洞迷宫
		91,--中原南区\伏牛山\鸡冠洞迷宫
		71,--两湖区\武陵山\白水洞迷宫
		73,--两湖区\武陵山\伏流洞迷宫
		94,--中原南区\蜀冈山\灵谷洞密宫
		194,--江南区\武夷山\玉华洞迷宫
		180,--江南区\罗霄山\龙宫洞迷宫
		182 --江南区\罗霄山\孽龙洞迷宫
	}
}

