Include("\\script\\skill\\head.lua")
SKILLS =  
{
	spider_web={--放射蜘蛛网
		frozen_action={
			[1]={{1,1},{20,1}},
			[2]={{1,18},{20,18}},
			[3]={{1,1},{20,1}}
		},
	},
	
	defence={ --各种防御
		allres_p={--全防，所有抗性
			[1]={{1,70},{20,70}},
			[2]={{1,18},{20,18}},
		},
	},
	
	mianyiyun={ --免疫眩晕
		stuntimereduce_p={--减少眩晕时间
			[1]={{1,140},{20,140}},
			[2]={{1,-1},{20,-1}},
		},
		ignorenegativestate_p={--忽略负面状态
			[1]={{1,70},{20,70}},
			[2]={{1,-1},{20,-1}},
		},
	},
	
	eightline={ --关卡8线性技能
		fatallystrike_p={ --攻击致命一击
			[1]={{1,70},{20,70}},
		},
		attackrating_p={ --攻击命中率
			[1]={{1,240},{20,240}},
		},
		ignoredefense_p={ --忽略敌人闪避的几率
			{{1,70},{20,70}},
		},
		colddamage_v={ --冰攻
			[1]={{1,19000},{20,19000}},
			[3]={{1,2900},{20,2900}},
		},
	},
}