--190¼¼ÄÜ½Å±¾
Include("\\script\\skill\\head.lua")
SKILLS={

	--½ð
	skill_190_jin=
	{ --½ðÏµ190±»¶¯¼¼ÄÜ
		skill_desc=
			function(level)
				return "<color=water>Kim C­¬ng Chi Né<color> lµm gi¶m hiÖu suÊt phôc håi sinh lùc, néi lùc cña ng­êi bÞ c«ng kÝch<color=orange>"..floor(-Link(level,SKILLS.skill_190_jin_zuzhou.lifereplenish_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.skill_190_jin_zuzhou.lifereplenish_p[2]) / 18).."<color> gi©y \n"
			end,	
		autoreplyskill=
		{--×Ô¶¯·´»÷×çÖäXXÖ®Å­
			{
				{1,(65536+1561)*256 + 1},{20,(65536+1561) *256 + 20},{21,(65536+1561) *256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
	},
	
	skill_190_jin_zuzhou=
	{--½ðÏµ190×çÖä×Ó¼¼ÄÜ½ð¸ÕÖ®Å­
		lifereplenish_p=
		{
			{
				{1,-1},{10,-5},{11,-7},{20,-15},{21,-18},{30,-30},{60,-35}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
		manareplenish_p=
		{
			{
				{1,-1},{10,-5},{11,-7},{20,-15},{21,-18},{30,-30},{60,-35}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
	},
	
	skill_190_jin_buff=
	{ --½ðÏµ190BUFF¼¼ÄÜ
		skill_desc=
			 function(level)
				return "<color=water>Kim C­¬ng Chi Hé <color>,".."gi¶m s¸t th­¬ng nhËn ®­îc tõ hÖ Méc <color=orange>"..floor(Link(level,SKILLS.metal.wood2medamage_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.metal.wood2medamage_p[2]) / 18).."<color> gi©y \n"
			 end,	
		autoreplyskill=
		{--×Ô¶¯´¥·¢XXÖ®»¤BUFF
			{
				{1,1566*256 + 1},{20,1566*256 + 20},{21,1566*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
		anti_block_rate={{{1,0},{11,0},{12,1},{16,1},{17,2},{20,2},{21,4},{23,4},{24,6},{27,10},{29,13},{31,15}},{{1,-1},{2,-1}}},
		lifemax_yan_p={{{1,1},{25,25},{26,27},{27,30},{30,30},{31,30}},{{1,-1},{30,-1}}},
		enhancehit_rate={{{1,0},{21,0},{22,1},{28,7},{30,7}},{{1,-1},{20,-1}}},
		skill_enhance={{{1,5},{2,10},{12,30},{13,33},{14,35},{15,38},{16,40},{17,43},{18,45},{19,48},{20,50},{25,65},{26,70},{28,80},{30,80},{31,80}},{{1,-1},{2,-1}}},
	},
	
	
	--Ä¾
	skill_190_mu=
	{ --Ä¾Ïµ190±»¶¯¼¼ÄÜ
		skill_desc=
			 function(level)
				return "<color=water>BÝch Méc Chi Né<color>, lµm t¨ng thêi gian tróng ®éc cña ng­êi bÞ c«ng kÝch <color=orange>"..floor(-Link(level,SKILLS.skill_190_mu_zuzhou.poisontimereduce_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.skill_190_mu_zuzhou.poisontimereduce_p[2]) / 18).."<color> gi©y \n"
			 end,				 
		autoreplyskill=
		{--×Ô¶¯·´»÷×çÖäXXÖ®Å­
			{
				{1,(65536+1562)*256 + 1},{20,(65536+1562)*256 + 20},{21,(65536+1562)*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
	},
	
	skill_190_mu_zuzhou=
	{--Ä¾Ïµ190×çÖä×Ó¼¼ÄÜ±ÌÄ¾Ö®Å­
		poisontimereduce_p=
		{
			{
				{1,-1},{10,-10},{11,-12},{20,-25},{21,-28},{30,-45},{60,-50}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
	},
	
	skill_190_mu_buff=
	{ --Ä¾Ïµ190BUFF¼¼ÄÜ
		skill_desc=
			 function(level)
				return "<color=water>BÝch Méc Chi Hé<color>,".."gi¶m s¸t th­¬ng nhËn ®­îc tõ hÖ Thæ <color=orange>"..floor(Link(level,SKILLS.wood.earth2medamage_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.wood.earth2medamage_p[2]) / 18).."<color> gi©y \n"
			 end,	
		autoreplyskill=
		{--×Ô¶¯´¥·¢XXÖ®»¤BUFF
			{
				{1,1567*256 + 1},{20,1567*256 + 20},{21,1567*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
		anti_block_rate={{{1,0},{11,0},{12,1},{16,1},{17,2},{20,2},{21,4},{23,4},{24,6},{27,10},{29,13},{31,15}},{{1,-1},{2,-1}}},
		lifemax_yan_p={{{1,1},{25,25},{26,27},{27,30},{30,30},{31,30}},{{1,-1},{30,-1}}},
		enhancehit_rate={{{1,0},{21,0},{22,1},{28,7},{30,7}},{{1,-1},{20,-1}}},
		skill_enhance={{{1,5},{2,10},{12,30},{13,33},{14,35},{15,38},{16,40},{17,43},{18,45},{19,48},{20,50},{25,65},{26,70},{28,80},{30,80},{31,80}},{{1,-1},{2,-1}}},
	},
	
	
	--Ë®
	skill_190_shui=
	{ --Ë®Ïµ190±»¶¯¼¼ÄÜ
		skill_desc=
			 function(level)
				return "<color=water>Hµn B¨ng Chi Né<color> lµm t¨ng thêi gian tr× ho·n cña ng­êi bÞ c«ng kÝch <color=orange>"..floor(-Link(level,SKILLS.skill_190_shui_zuzhou.freezetimereduce_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.skill_190_shui_zuzhou.freezetimereduce_p[2]) / 18).."<color> gi©y \n"
			 end,	
		autoreplyskill=
		{--×Ô¶¯·´»÷×çÖäXXÖ®Å­
			{
				{1,(65536+1563)*256 + 1},{20,(65536+1563)*256 + 20},{21,(65536+1563)*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
	},
	
	skill_190_shui_zuzhou=
	{--Ë®Ïµ190×çÖä×Ó¼¼ÄÜº®±ùÖ®Å­
		freezetimereduce_p=
		{
			{
				{1,-1},{10,-10},{11,-12},{20,-25},{21,-28},{21,-45},{60,-50}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
	},
	
	skill_190_shui_buff=
	{ --Ë®Ïµ190BUFF¼¼ÄÜ
		skill_desc=
			 function(level)
				return "<color=water>Hµn B¨ng Chi Hé<color>,".."gi¶m s¸t th­¬ng nhËn ®­îc tõ hÖ Háa <color=orange>"..floor(Link(level,SKILLS.water.fire2medamage_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.water.fire2medamage_p[2]) / 18).."<color> gi©y \n"
			 end,	
		autoreplyskill=
		{--×Ô¶¯´¥·¢XXÖ®»¤BUFF
			{
				{1,1568*256 + 1},{20,1568*256 + 20},{21,1568*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
		anti_block_rate={{{1,0},{11,0},{12,1},{16,1},{17,2},{20,2},{21,4},{23,4},{24,6},{27,10},{29,13},{31,15}},{{1,-1},{2,-1}}},
		lifemax_yan_p={{{1,1},{25,25},{26,27},{27,30},{30,30},{31,30}},{{1,-1},{30,-1}}},
		enhancehit_rate={{{1,0},{21,0},{22,1},{28,7},{30,7}},{{1,-1},{20,-1}}},
		skill_enhance={{{1,5},{2,10},{12,30},{13,33},{14,35},{15,38},{16,40},{17,43},{18,45},{19,48},{20,50},{25,65},{26,70},{28,80},{30,80},{31,80}},{{1,-1},{2,-1}}},
	},
	
	
	--»ð
	skill_190_huo=
	{ --»ðÏµ190±»¶¯¼¼ÄÜ
		skill_desc=
			function(level)
				return "<color=water>Viªm D­¬ng Chi Né<color> lµm gi¶m x¸c suÊt hãa gi¶i s¸t th­¬ng cña ng­êi bÞ c«ng kÝch <color=orange>"..floor(-Link(level,SKILLS.skill_190_huo_zuzhou.block_rate[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.skill_190_huo_zuzhou.block_rate[2]) / 18).."<color> gi©y \n"
			end,
		autoreplyskill=
		{--×Ô¶¯·´»÷×çÖäXXÖ®Å­
			{
				{1,(65536+1564)*256 + 1},{20,(65536+1564)*256 + 20},{21,(65536+1564)*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
	},
	
	skill_190_huo_zuzhou=
	{--»ðÏµ190×çÖä×Ó¼¼ÄÜÑ×ÑôÖ®Å­
		block_rate=
		{
			{
				{1,-1},{10,-5},{11,-7},{20,-13},{21,-16},{30,-25},{60,-30}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
	},
	
	skill_190_huo_buff=
	{ --»ðÏµ190BUFF¼¼ÄÜ
		skill_desc=
			function(level)
				return "<color=water>Viªm D­¬ng Chi Hé<color>,".."gi¶m s¸t th­¬ng nhËn ®­îc tõ hÖ Kim <color=orange>"..floor(Link(level,SKILLS.fire.metal2medamage_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.fire.metal2medamage_p[2]) / 18).."<color> gi©y \n"
			end,	
		autoreplyskill=
		{--×Ô¶¯´¥·¢XXÖ®»¤BUFF
			{
				{1,1569*256 + 1},{20,1569*256 + 20},{21,1569*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
		anti_block_rate={{{1,0},{11,0},{12,1},{16,1},{17,2},{20,2},{21,4},{23,4},{24,6},{27,10},{29,13},{31,15}},{{1,-1},{2,-1}}},
		lifemax_yan_p={{{1,1},{25,25},{26,27},{27,30},{30,30},{31,30}},{{1,-1},{30,-1}}},
		enhancehit_rate={{{1,0},{21,0},{22,1},{28,7},{30,7}},{{1,-1},{20,-1}}},
		skill_enhance={{{1,5},{2,10},{12,30},{13,33},{14,35},{15,38},{16,40},{17,43},{18,45},{19,48},{20,50},{25,65},{26,70},{28,80},{30,80},{31,80}},{{1,-1},{2,-1}}},
	},
	
	--ÍÁ
	skill_190_tu=
	{ --ÍÁÏµ190±»¶¯¼¼ÄÜ
		skill_desc=
			function(level)
				return "<color=water>L«i §×nh Chi Né<color> lµm t¨ng thêi gian cho¸ng cña ng­êi bÞ c«ng kÝch <color=orange>"..floor(-Link(level,SKILLS.skill_190_tu_zuzhou.stuntimereduce_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.skill_190_tu_zuzhou.stuntimereduce_p[2]) / 18).."<color> gi©y \n"
			end,
		autoreplyskill=
		{--×Ô¶¯·´»÷×çÖäXXÖ®Å­
			{
				{1,(65536+1565)*256 + 1},{20,(65536+1565)*256 + 20},{21,(65536+1565)*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
	},
	
	skill_190_tu_zuzhou=
	{--ÍÁÏµ190×çÖä×Ó¼¼ÄÜÀ×öªÖ®Å­
		stuntimereduce_p=
		{
			{
				{1,-1},{10,-10},{11,-12},{20,-25},{21,-28},{30,-45},{60,-50}
			},
			{
				{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}
			}
		},
	},
	
	skill_190_tu_buff=
	{ --ÍÁÏµ190BUFF¼¼ÄÜ
		skill_desc=
			function(level)
				return "<color=water>L«i §×nh Chi Hé<color>,".."gi¶m s¸t th­¬ng nhËn ®­îc tõ hÖ Thñy<color=orange>"..floor(Link(level,SKILLS.earth.water2medamage_p[1]))..
				"%<color> tèc ®é di chuyÓn trong <color=orange>"..floor(Link(level,SKILLS.earth.water2medamage_p[2]) / 18).."<color> gi©y \n"
			end,
		autoreplyskill=
		{--×Ô¶¯´¥·¢XXÖ®»¤BUFF
			{
				{1,1570*256 + 1},{20,1570*256 + 20},{21,1570*256 + 21}
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,15*18*256 + 1},{10,15*18*256 + 5},{11,15*18*256 + 6},{20,15*18*256 + 12},{21,15*18*256 + 13},{30,15*18*256 + 20},{31,15*18*256 + 20}
			}
		},
		anti_block_rate={{{1,0},{11,0},{12,1},{16,1},{17,2},{20,2},{21,4},{23,4},{24,6},{27,10},{29,13},{31,15}},{{1,-1},{2,-1}}},
		lifemax_yan_p={{{1,1},{25,25},{26,27},{27,30},{30,30},{31,30}},{{1,-1},{30,-1}}},
		enhancehit_rate={{{1,0},{21,0},{22,1},{28,7},{30,7}},{{1,-1},{20,-1}}},
		skill_enhance={{{1,5},{2,10},{12,30},{13,33},{14,35},{15,38},{16,40},{17,43},{18,45},{19,48},{20,50},{25,65},{26,70},{28,80},{30,80},{31,80}},{{1,-1},{2,-1}}},
	},
	
	
--190¼¼ÄÜ-½ð-¼õÄ¾ÏµÉËº¦
		metal={
		wood2medamage_p={{{1,1},{10,5},{11,7},{20,13},{21,16},{30,25},{60,30}},{{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}}},--¼õÉÙÀ´×ÔÄ¾ÏµµÄÉËº¦
		},
		--190¼¼ÄÜ-Ä¾-¼õÍÁÏµÉËº¦
		wood={
		earth2medamage_p={{{1,1},{10,5},{11,7},{20,13},{21,16},{30,25},{60,30}},{{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}}},--¼õÉÙÀ´×ÔÍÁÏµµÄÉËº¦
		},
		--190¼¼ÄÜ-Ë®-¼õ»ðÏµÉËº¦
		water={
		fire2medamage_p={{{1,1},{10,5},{11,7},{20,13},{21,16},{30,25},{60,30}},{{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}}},--¼õÉÙÀ´×Ô»ðÏµµÄÉËº¦
		},
		--190¼¼ÄÜ-»ð-¼õ½ðÏµÉËº¦
		fire={
		metal2medamage_p={{{1,1},{10,5},{11,7},{20,13},{21,16},{30,25},{60,30}},{{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}}},--¼õÉÙÀ´×Ô½ðÏµµÄÉËº¦
		},
		--190¼¼ÄÜ-ÍÁ-¼õË®ÏµÉËº¦
		earth={
		water2medamage_p={{{1,1},{10,5},{11,7},{20,13},{21,16},{30,25},{60,30}},{{1,3*18},{10,6*18},{11,7*18},{20,12*18},{21,12*18}}},--¼õÉÙÀ´×ÔË®ÏµµÄÉËº¦
		},
	 
	 --7×ª¼¼ÄÜºöÂÔ¸÷¿¹ÐÔ
	 --ºöÂÔ¶Ô·½ÆÕ·À£º#d1-%£¨Ñô£©
		anti_metal={
			anti_physicsres_yan_p={{{1,20},{20,20}},{{1,-1},{20,-1}}}
		},
		--ºöÂÔ¶Ô·½¶¾·À£º#d1-%£¨Ñô£©
		anti_wood={
			anti_poisonres_yan_p={{{1,30},{20,30}},{{1,-1},{20,-1}}}
		},
		--ºöÂÔ¶Ô·½±ù·À£º#d1-%£¨Ñô£©
		anti_water={
			anti_coldres_yan_p={{{1,30},{20,30}},{{1,-1},{20,-1}}}
		},
		--ºöÂÔ¶Ô·½»ð·À£º#d1-%£¨Ñô£©
		anti_fire={
			anti_fireres_yan_p={{{1,30},{20,30}},{{1,-1},{20,-1}}}
		},
		--ºöÂÔ¶Ô·½À×·À£º#d1-%£¨Ñô£©
		anti_earth={
			anti_lightingres_yan_p={{{1,30},{20,30}},{{1,-1},{20,-1}}}
		},
	
	 
	 
}

