--新宋金遭遇战各类临时BUFF效果
--created by beautiful Huihui 2013-3-12

Include("\\script\\skill\\head.lua")

SKILLS={
	--血量增加（百分比），1级加10%，每级多10%。默认三分钟
	add_lifemaxp = 
	{
		lifemax_yan_p={{{1,10},{25,250}},{{1,18*60*3},{30,18*60*3}}},
		},

	--内力增加（百分比），1级加10%，每级多10%。默认三分钟
	add_manamaxp =
	{
		manamax_yan_p={{{1,10},{10,100}},{{1,18*60*3},{2,18*60*3}}},
		},
		
	--减受伤动作，10级受伤动作减30
	min_fasyan = 
	{
		fasthitrecover_yan_v={{{1,3},{10,30}},{{1,18*60*3},{2,18*60*3}}},
		},
		
	--减中毒时间，10级中毒时间减50%
	min_poitime =
	{
		poisontimereduce_p={{{1,5},{10,50}},{{1,18*60*3},{2,18*60*3}}},
		},
		
	--减迟缓时间
	min_coldtime =
	{
		freezetimereduce_p={{{1,5},{10,50}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--减晕眩时间
	min_stuntime=
	{
		stuntimereduce_p={{{1,5},{10,50}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	
	--全抗增加，十级全抗加100%
	add_allres=
	{
		allres_yan_p={{{1,10},{10,100}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--血内增加
	add_lifemana=
	{
		lifemax_yan_p={{{1,5},{10,50}},{{1,18*60*3},{2,18*60*3}}},
		manamax_yan_p={{{1,5},{10,50}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--加跑速，10级跑速加50%
	add_speed=
	{
		fastwalkrun_yan_p={{{1,10},{10,100}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--加闪避，10级闪避加5000
	add_defen=
	{
		adddefense_v={{{1,500},{10,5000}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--加命中10级命中加10000
	add_attrate=
	{
		attackrating_v={{{1,1000},{10,10000}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--加攻速，10级攻速加30%
	add_attspeed =
	{
		attackspeed_yan_v={{{1,1},{10,30}},{{1,18*60*3},{2,18*60*3}}},
		castspeed_yan_v={{{1,1},{10,30}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--攻击技能加成，10级攻击技能加100%
	add_skillgong=
	{
		skill_enhance={{{1,10},{10,100}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--加重击概率，10级重击加15%
	add_heavyatt=
	{
		enhancehit_rate={{{1,3},{10,15}},{{1,18*60*3},{2,18*60*3}}},
		},
	
	--抵挡重击概率，10级抵抗重击加15%
	min_heavyatt=
	{
		anti_enhancehit_rate={{{1,3},{10,15}},{{1,18*60*3},{2,18*60*3}}},
		},
	
}
