--越南收费版新BIG BOSS李白剑仙技能

Include("\\script\\skill\\head.lua")
SKILLS={
	
	bihai_chaosheng={ --超级碧海潮生，高伤害CD60秒
		seriesdamage_p={{{1,10},{20,80},{21,80}}},--五行相克80%
		physicsdamage_v={
			[1]={{1,200},{20,500000}},--普攻伤害提升到500000%
			[3]={{1,200},{20,500000}},
		},
		colddamage_v={
			[1]={{1,43},{20,5000000}},--冰攻伤害提升到5000000-5000000
			[3]={{1,43},{20,5000000}}
		},
		skill_cost_v={{{1,65},{20,65}}}
	},
	
	emei120={ --超级闭月拂尘，双倍效果,光环技能。子技能属性添加本技能，无子技能。都按20级数据算
		fastwalkrun_p={{{1,9},{20,125}},{{1,18},{2,18}}}, --移动速度增加125%
		lifereplenish_v={{{1,1},{20,600}},{{1,18},{2,18}}},--每半秒生命回复600
		manareplenish_v={{{1,1},{20,400}},{{1,18},{2,18}}},--每半秒内力回复400
		allres_p={{{1,1},{20,80}},{{1,18},{2,18}}},       --所有抗性增加80%
		--lifemax_p={{{1,30},{20,225}},{{1,18*8},{2,18*8}}},--生命最大值增加225%(去掉增加生命值效果，直接修改NPC血量)
		--lifemax_yan_p={{{1,30},{20,100}},{{1,18*8},{2,18*8}}},--生命最大值增加100%（阳）
		fasthitrecover_v={{{1,1},{20,30}},{{1,18},{2,18}}},--受伤动作时间减少30
		fasthitrecover_yan_v={{{1,1},{20,10}},{{1,18},{2,18}}},--受伤动作时间减少10（阳）
		fatallystrikeres_p={{{1,1},{20,40}},{{1,18},{2,18}}},--致命一击抵抗力增加40%
		-- freezetimereduce_p={{{1,1},{20,60}},{{1,18},{2,18}}},--迟缓时间减少60%
		-- poisontimereduce_p={{{1,1},{20,60}},{{1,18},{2,18}}},--中毒时间减少60%
		-- stuntimereduce_p={{{1,1},{20,60}},{{1,18},{2,18}}},--眩晕时间减少60%
		meleedamagereturn_p={{{1,15},{19,50},{20,110},{21,110}},{{1,18},{2,18}}},--近身反伤1级15%，19级50%,20级110%
		rangedamagereturn_p={{{1,15},{19,50},{20,110},{21,110}},{{1,18},{2,18}}},--远程反伤1级15%，19级50%,20级110%
	},
		emei1201={ --超级闭月拂尘
		fastwalkrun_p={{{1,9},{20,125}},{{1,18},{2,18}}}, --移动速度增加
		lifereplenish_v={{{1,100},{20,2000},{40,3000},{41,3000}},{{1,18},{2,18}}},--每半秒生命回复
		manareplenish_v={{{1,100},{20,2000},{40,3000},{41,3000}},{{1,18},{2,18}}},--每半秒内力回复
		allres_yan_p={{{1,10},{20,70},{40,80},{40,80}},{{1,18},{2,18}}}, --所有抗性增加
		meleedamagereturn_p={{{1,5},{20,110},{40,130},{41,130}},{{1,18},{2,18}}},--近身反伤
		rangedamagereturn_p={{{1,5},{20,110},{40,130},{41,130}},{{1,18},{2,18}}},--远程反伤
		poisondamagereturn_p={{{1,1},{20,10},{40,20},{41,20}},{{1,18},{2,18}}},--增加毒伤反弹
		anti_block_rate={{{1,1},{20,100}},{{1,18},{2,18}}},--拆解格挡概率
		block_rate={{{1,1},{20,120},{21,120}},{{1,18},{2,18}}},--格挡概率
		enhancehit_rate={{{1,500},{2,500}},{{1,18},{2,18}}},--重击概率 
		anti_allres_yan_p={{{1,40},{20,70},{21,70}},{{1,18},{2,18}}}, --忽略对方全抗
		anti_sorbdamage_yan_p={{{1,200},{10,200}},{{1,18},{2,18}}}, --加深伤害
		anti_enhancehit_rate={{{1,200},{2,200}},{{1,18},{2,18}}},--抵挡重击概率 
		sorbdamage_yan_p={{{1,200},{20,300},{40,320},{41,320}},{{1,18},{2,18}}},--抵消伤害 
		attackratingenhance_p={{{1,1000},{20,1000}},{{1,18},{2,18}}},--加命中
		skill_enhance={{{1,5},{20,200},{40,220},{41,220}},{{1,18},{2,18}}},--对攻击技能加成
	},

	kangfantan={	--抗反弹
		returnres_p={{{1,3000},{2,3000}},{{1,-1},{20,-1}}},	
	},

		emei1202={ --闭月拂尘（被动）
		fastwalkrun_p={{{1,9},{20,125}},{{1,18},{2,18}}}, --移动速度增加
		lifereplenish_v={{{1,100},{20,2000},{40,3000},{41,3000}},{{1,18},{2,18}}},--每半秒生命回复
		manareplenish_v={{{1,100},{20,2000},{40,3000},{41,3000}},{{1,18},{2,18}}},--每半秒内力回复
		allres_yan_p={{{1,10},{20,70},{40,80},{40,80}},{{1,18},{2,18}}}, --所有抗性增加
		meleedamagereturn_p={{{1,5},{20,110},{40,110}},{{1,18},{2,18}}},--近身反伤
		rangedamagereturn_p={{{1,5},{20,110},{40,110}},{{1,18},{2,18}}},--远程反伤
		poisondamagereturn_p={{{1,1},{20,10},{40,20},{41,20}},{{1,18},{2,18}}},--增加毒伤反弹
		anti_block_rate={{{1,1},{20,100}},{{1,-1},{2,-1}}},--拆解格挡概率
		block_rate={{{1,1},{20,120},{21,120}},{{1,-1},{20,-1}}},--格挡概率
		enhancehit_rate={{{1,500},{2,500}},{{1,-1},{20,-1}}},--重击概率 
		anti_allres_yan_p={{{1,40},{20,70},{21,70}},{{1,18},{2,18}}}, --忽略对方全抗
		anti_sorbdamage_yan_p={{{1,200},{10,200}},{{1,18},{2,18}}}, --加深伤害
		anti_enhancehit_rate={{{1,200},{2,200}},{{1,-1},{20,-1}}},--抵挡重击概率 
		sorbdamage_yan_p={{{1,200},{20,200},{40,250},{41,250}},{{1,-1},{20,-1}}},--抵消伤害 
		--attackratingenhance_p={{{1,1000},{20,1000}},{{1,18},{2,18}}},--加命中
		skill_enhance={{{1,5},{20,100},{40,150},{41,150}},{{1,-1},{2,-1}}},--对攻击技能加成
		fasthitrecover_v={{{1,2000},{2,2000}},{{1,18},{2,18}}},--受伤动作时间减少
		fatallystrikeres_p={{{1,2000},{2,2000}},{{1,18},{2,18}}},--致命一击抵抗力增加
		freezetimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--迟缓时间减少
		poisontimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--中毒时间减少
		stuntimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--眩晕时间减少
	},

		emei1203={ --超级闭月拂尘（光环无反弹）
		fastwalkrun_p={{{1,9},{20,125}},{{1,18},{2,18}}}, --移动速度增加
		lifereplenish_v={{{1,100},{20,1000},{40,2000},{41,2000}},{{1,18},{2,18}}},--每半秒生命回复
		manareplenish_v={{{1,100},{20,1000},{40,2000},{41,2000}},{{1,18},{2,18}}},--每半秒内力回复
		allres_yan_p={{{1,10},{20,70},{40,80},{40,80}},{{1,18},{2,18}}}, --所有抗性增加
		--meleedamagereturn_p={{{1,5},{20,110},{40,130},{41,130}},{{1,18},{2,18}}},--近身反伤
		--rangedamagereturn_p={{{1,5},{20,110},{40,130},{41,130}},{{1,18},{2,18}}},--远程反伤
		--poisondamagereturn_p={{{1,1},{20,10},{40,20},{41,20}},{{1,18},{2,18}}},--增加毒伤反弹
		anti_block_rate={{{1,1},{20,80}},{{1,-1},{2,-1}}},--拆解格挡概率
		block_rate={{{1,1},{20,100},{21,100}},{{1,-1},{20,-1}}},--格挡概率
		enhancehit_rate={{{1,100},{2,100}},{{1,-1},{20,-1}}},--重击概率 
		anti_allres_yan_p={{{1,40},{20,70},{21,70}},{{1,18},{2,18}}}, --忽略对方全抗
		anti_sorbdamage_yan_p={{{1,100},{10,100}},{{1,18},{2,18}}}, --加深伤害
		anti_enhancehit_rate={{{1,200},{2,200}},{{1,-1},{20,-1}}},--抵挡重击概率 
		sorbdamage_yan_p={{{1,100},{20,100},{40,250},{41,250}},{{1,-1},{20,-1}}},--抵消伤害 
		attackratingenhance_p={{{1,1000},{20,1000}},{{1,18},{2,18}}},--加命中
		skill_enhance={{{1,5},{20,100},{40,150},{41,150}},{{1,-1},{2,-1}}},--对攻击技能加成
	},

		jiafangyu={ --冰眩免疫（多加防御）
		allres_yan_p={{{1,50},{10,50}},{{1,18},{2,18}}}, --所有抗性增加
		block_rate={{{1,10},{10,10}},{{1,-1},{20,-1}}},--格挡概率
		anti_enhancehit_rate={{{1,500},{10,500}},{{1,-1},{20,-1}}},--抵挡重击概率 
		sorbdamage_yan_p={{{1,500},{10,500}},{{1,-1},{20,-1}}},--抵消伤害
	    wood2medamage_p={{{1,10},{20,10}},{{1,-1},{2,-1}}},--减少来自木系的伤害
		earth2medamage_p={{{1,10},{20,10}},{{1,-1},{2,-1}}},--减少来自土系的伤害
		fire2medamage_p={{{1,10},{20,10}},{{1,-1},{2,-1}}},--减少来自火系的伤害
		metal2medamage_p={{{1,10},{20,10}},{{1,-1},{2,-1}}},--减少来自金系的伤害
		water2medamage_p={{{1,10},{20,10}},{{1,-1},{2,-1}}},--减少来自水系的伤害
		fasthitrecover_v={{{1,2000},{2,2000}},{{1,18},{2,18}}},--受伤动作时间减少
		fatallystrikeres_p={{{1,2000},{2,2000}},{{1,18},{2,18}}},--致命一击抵抗力增加
		freezetimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--迟缓时间减少
		poisontimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--中毒时间减少
		stuntimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--眩晕时间减少
	},

		jiafangyu1={ --冰眩免疫（多加防御）
		allres_yan_p={{{1,10},{10,10}},{{1,18},{2,18}}}, --所有抗性增加
		block_rate={{{1,10},{10,10}},{{1,-1},{20,-1}}},--格挡概率
		anti_enhancehit_rate={{{1,100},{10,100}},{{1,-1},{20,-1}}},--抵挡重击概率 
		sorbdamage_yan_p={{{1,50},{10,50}},{{1,-1},{20,-1}}},--抵消伤害 
		fasthitrecover_v={{{1,2000},{2,2000}},{{1,18},{2,18}}},--受伤动作时间减少
		fatallystrikeres_p={{{1,2000},{2,2000}},{{1,18},{2,18}}},--致命一击抵抗力增加
		freezetimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--迟缓时间减少
		poisontimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--中毒时间减少
		stuntimereduce_p={{{1,3000},{2,3000}},{{1,18},{2,18}}},--眩晕时间减少
	},
	
}