Include("\\script\\skill\\head.lua")
SKILLS={
	huwan7={ --»¤Íó7ºÅ¼¼ÄÜ£¬µ±½ÇÉ«»÷ÖĞµĞÈË£¬ÓĞ1%¸ÅÂÊÔÚ5ÃëÊ¹µĞÈË²»ÄÜÊ¹ÓÃÎä¹¦,CD1Ãë
		autoattackskill={{{1,1265*256 + 1},{20,1265*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 1},{20,1*18*256 + 1}}},
					},
	huwan7_zuzhou={ --»¤Íó7ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬5ÃëÄÚ²»ÄÜÊ¹ÓÃ¼¼ÄÜ
		forbit_attack={
			[1]={{1,1},{20,1}},
			[2]={{1,18*5},{2,18*5.5},{3,18*6},{4,18*6}}
									},
								},

	xianglian3 ={ --ÏîÁ´3ºÅ¼¼ÄÜ¡£µ±½ÇÉ«±»»÷ÖĞÊ±ºòÑªÁ¿µÍÓÚ25%£¬10%¸ÅÂÊ»ñµÃ5ÃëÒşÉí¡£´ËÊ±½ÇÉ«¹¥»÷µĞÈËÉËº¦x4£¬¹¥»÷ÊÇÒşÉí×´Ì¬ÏûÊ§¡£CD10Ãë
		autorescueskill=
		{
			{
				{1,1267*256 + 1},{20,1267*256 + 20},
			},
			{
				{1,-1},{20,-1}
			},
			{
				{1,10*18*256 + 10},
				{2,10*18*256 + 15},
				{3,10*18*256 + 20},
				{4,10*18*256 + 20},
			}
		},
					},
	xianglian3_fuzhu={ --ÏîÁ´3ºÅ¼¼ÄÜÊµ¼ÊĞ§¹û£¬ÒşÉí5Ãë£¬Í¬Ê±ÖØ»÷¸ÅÂÊ100%³ÖĞø4Ãë£¬ÖØ»÷Ğ§¹û200%
		hide={{{1,1},{20,1}},{{1,5*18},{20,5*18}}},
		enhancehit_rate={{{1,100},{2,100}},{{1,18*4},{20,18*4}}},
		enhancehiteffect_rate=
		{
  		[1] = {{1,200},{2,200}},
  		[2] = {{1,18*4},{20,18*4}},
  		[3] = {},
		},
	},
	
	yuenan1hao={ --Ô½ÄÏ1ºÅ¼¼ÄÜ£¬µ±½ÇÉ«»÷ÖĞµĞÈË£¬ÓĞ1%¸ÅÂÊºöÂÔµĞ·½È«¿¹100%¡£CD1Ãë
		autoattackskill={{{1,1320*256 + 1},{20,1320*256 + 20}},{{1,-1},{20,-1}},{{1,10*18*256 + 1},{2,10*18*256 + 2},{3,10*18*256 + 3},{4,10*18*256 + 3}}},
		skill_desc=
			function(level)
				return "Khi tróng ®Şch cã<color=orange>1%<color>tØ lÖ kİch ho¹t<color=orange>bá qua kh¸ng tÊt c¶ cña ®èi ph­¬ng 100%<color>hiÖu øng, duy tr× 1 gi©y\n"
			end,
					},
	yuenan1_duzhu={ --Ô½ÄÏ1ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬3ÃëÄÚºöÂÔÈ«¿¹100%£¬³ÖĞø1Ãë
		anti_allres_yan_p={
			[1]={{1,100},{20,100}},
			[2]={{1,18*3},{20,18*3}},
			[3]={},
									},
		},
		
		yuenan2hao={ --Ô½ÄÏ2ºÅ¼¼ÄÜ£¬½ÇÉ«ËÀÍöÊ±50%¸ÅÂÊÊ¹ÖÜÎ§400·¶Î§ÄÚµÄ½ÇÉ«¼¼ÄÜ¹¥»÷½µµÍ45%
		autodeathskill={{{1,1322*256 + 1},{20,1322*256 + 20}},{{1,-1},{20,-1}},{{1,50},{2,55},{3,60},{4,60}}},
		skill_desc=
			function(level)
				return "Sau khi chÕt cã<color=orange>50%<color>tØ lÖ lµm cho kÜ n¨ng c«ng kİch cña nh©n vËt xung quanh gi¶m ®i<color=orange>45%<color>hiÖu øng, duy tr×<color=orange>10<color>gi©y\n"
			end,
					},
	yuenan2_duzhu={ --Ô½ÄÏ2ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬¼¼ÄÜ¹¥»÷½µµÍ45%£¬³ÖĞø10Ãë
		skill_enhance={
			[1]={{1,-300},{2,-400},{3,-500},{4,-500}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
		missle_hitcount={{{1,8},{20,8}}},
		},
		
	yuenan4hao={ --Ô½ÄÏ4ºÅ¼¼ÄÜ£¬½ÇÉ«ÑªÁ¿µÍÓÚ25%Ë²¼ä£¬Ôö¼Ó2000ÄÚ¹¦ÉËº¦£¬100ÆÕµãÉËº¦£¬³ÖĞø10Ãë
		autorescueskill={{{1,1324*256 + 1},{20,1324*256 + 20}},{{1,-1},{20,-1}},{{1,10*18*256 + 100},{20,10*18*256 + 100}}},
			skill_desc=
			function(level)

				local nMag = floor(Link(level,SKILLS.yuenan4_duzhu.addcoldmagic_v[1]))
				local nPois = floor(Link(level,SKILLS.yuenan4_duzhu.addpoisonmagic_v[1]))
				local nAtk = floor(Link(level,SKILLS.yuenan4_duzhu.addphysicsdamage_v[1]))
				return format("Khi sinh lùc thÊp h¬n 25%% n©ng cao c«ng kİch néi c«ng<color=orange>%d<color>®iÓm, \n®éc c«ng s¸t th­¬ng<color=orange>%d<color>®iÓm, \nn©ng cao phæ ®iÓm<color=orange>%d<color>®iÓm\n", nMag, nPois, nAtk)
			end,
					},
	yuenan4_duzhu={ --Ôö¼Ó2000ÄÚ¹¦ÉËº¦£¬100ÆÕµãÉËº¦£¬³ÖĞø10Ãë
		addcoldmagic_v={
			[1]={{1,2000},{20,2000}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
			addfiremagic_v={
			[1]={{1,2000},{20,2000}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
			addlightingmagic_v={
			[1]={{1,2000},{20,2000}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
			addphysicsmagic_v={
			[1]={{1,2000},{20,2000}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
			addpoisonmagic_v={
			[1]={{1,200},{20,200}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
			addphysicsdamage_v={
			[1]={{1,100},{20,100}},
			[2]={{1,18*10},{20,18*10}},
			[3]={},
			},
		},
		
	yuenan5hao={ --Ô½ÄÏ5ºÅ¼¼ÄÜ£¬±»µĞÈËÃüÖĞ£¬3%µÄ¼¸ÂÊÊ¹×Ô¼ºÑªÁ¿+3000£¬³ÖĞø20Ãë
		autoreplyskill={{{1,1326*256 + 1},{20,1326*256 + 20}},{{1,-1},{20,-1}},{{1,20*18*256 + 3},{20,20*18*256 + 3}}},
					},
	yuenan5_duzhu={ --Ô½ÄÏ5ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬ÑªÁ¿+3000£¬³ÖĞø20Ãë
		lifemax_yan_v={
			[1]={{1,3000},{2,5000},{3,7000},{4,7000}},
			[2]={{1,18*20},{20,18*20}},
			[3]={},
			},
		},
		
		yuenan6hao={ --Ô½ÄÏ6ºÅ¼¼ÄÜ£¬ÖØ»÷15%
		enhancehit_rate={{{1,15},{2,17},{3,20},{4,20}},{{1,-1},{20,-1}}},
					},
					
		yuenan8hao={ --Ô½ÄÏ8ºÅ¼¼ÄÜ£¬½ûÖ¹Ê¹ÓÃ¼¼ÄÜ£¬³ÖĞø5Ãë£¬×î¶à8ÈË¡£
		forbit_attack={{{1,1},{20,1}},{{1,5*18},{2,5.5*18},{3,6*18},{4,6*18}}},
		missle_hitcount={{{1,8},{2,10},{3,12},{4,12}}},
		skill_desc=
			function(level)
				return "Lµm cho xung quanh nhiÒu nhÊt<color=orange>8<color>ng­êi kh«ng thÓ sö dông kÜ n¨ng, duy tr×<color=orange>5<color>gi©y, 2 phót cã thÓ sö dông 1 lÇn\n"
			end,
					},
					
	yuenan9hao={ --Ô½ÄÏ9ºÅ¼¼ÄÜ£¬ÃüÖĞµĞÈËÊ±£¬1%µÄ¸ÅÂÊÊ¹µĞÈËÊ§È¥50%ÑªÁ¿
		autoattackskill={{{1,1330*256 + 1},{20,1330*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 1},{2,1*18*256 + 1.5},{3,1*18*256 + 2},{4,1*18*256 + 2}}},
		skill_desc=
			function(level)
				return "Khi tróng ®Şch, cã<color=orange>1%<color>tØ lÖ lµm cho ®Şch tæn thÊt<color=orange>50%<color>l­îng m¸u\n"
			end,
					},
	yuenan9_duzhu={ --Ô½ÄÏ9ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬Ê¹µĞÈËÊ§È¥50%ÑªÁ¿ÉÏÏŞ²¢Ê§È¥3000ÑªÁ¿
		fatallystrike_p={
			[1]={{1,100},{20,100}},
			[2]={},
			[3]={},
			},
		
		},
		
		yuenan10hao={ --Ô½ÄÏ10ºÅ¼¼ÄÜ£¬±»ÃüÖĞÊ±£¬3%µÄ¸ÅÂÊ´¥·¢·´µ¯ÉËº¦50%£¬³ÖĞø3Ãë
		autoreplyskill={{{1,1332*256 + 1},{20,1332*256 + 20}},{{1,-1},{20,-1}},{{1,3*18*256 + 3},{2,3*18*256 + 4},{3,3*18*256 + 5},{4,3*18*256 + 5}}},
					},
	yuenan10_duzhu={ --Ô½ÄÏ10ºÅ¼¼ÄÜ¾ßÌåĞ§¹û£¬·´µ¯50%£¬³ÖĞø3Ãë
		meleedamagereturn_p={
			[1]={{1,50},{20,50}},
			[2]={{1,18*3},{20,18*3}},
			[3]={},
			},
		rangedamagereturn_p={
			[1]={{1,50},{20,50}},
			[2]={{1,18*3},{20,18*3}},
			[3]={},
			},
		},
		
}
