--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end

SKILLS={
	--白金装备
	baijinwaipu_1={ --白金外普1
		addphysicsdamage_p={
			{{1,0},{5,0},{6,30},{10,30}},
			{{1,-1},{2,-1}},
			{{1,6},{2,6}},
		},
	},
	
	baijinwaipu_2={ --白金外普2
		addphysicsdamage_v={
			{{1,0},{9,0},{10,10},{11,10}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	
	baijinwaipu_3={ --白金外普3
		attackratingenhance_p={
		  {{1,0},{5,0},{6,300},{10,300}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	
	baijinwaipu_4={ --白金外普4
		addphysicsdamage_p
		={
		  {{1,0},{9,0},{10,40},{11,40}},
			{{1,-1},{2,-1}},
			{{1,6},{2,6}},
		},
	},	
	
	baijinneibing_1={ --白金内冰1
		addcoldmagic_v={
			{{1,0},{5,0},{6,70},{10,70}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	baijinneibing_2={ --白金内冰2
		addcoldmagic_v={
			{{1,0},{5,0},{6,100},{10,100}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinneibing_3={ --白金内冰3
		addcoldmagic_v={
			{{1,0},{9,0},{10,120},{11,120}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
		baijinneibing_4={ --白金内冰4
		addcoldmagic_v={
			{{1,0},{9,0},{10,200},{11,200}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	baijinneidu_1={ --白金内毒1
		addpoisonmagic_v={
			{{1,0},{5,0},{6,10},{10,10}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
		addpoisonmagic_v={
			{{1,0},{9,0},{10,20},{11,20}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinneidu_2={ --白金内毒2
		addpoisonmagic_v={
			{{1,0},{9,0},{10,20},{11,20}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	baijinneihuo_1={ --白金内火1
		addfiremagic_v={
			{{1,0},{5,0},{6,70},{10,70}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	baijinneihuo_2={ --白金内火2
		addfiremagic_v={
			{{1,0},{5,0},{6,50},{10,50}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinneihuo_3={ --白金内火3
		addfiremagic_v={
			{{1,0},{9,0},{10,120},{11,120}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinneihuo_4={ --白金内火4
		addfiremagic_v={
			{{1,0},{9,0},{10,100},{11,100}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	baijinneilei_1={ --白金内雷1
		addlightingmagic_v={
			{{1,0},{5,0},{6,70},{10,70}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinneilei_2={ --白金内雷2
		addlightingmagic_v={
			{{1,0},{9,0},{10,120},{11,120}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	baijinshaolin_1_1={ --白金少林拳1
		enhance_709_auto={
			{{1,0},{5,0},{6,1},{10,1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinshaolin_1_2={ --白金少林拳2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,318},{2,318}},
		},
	},
			baijinshaolin_1_3={ --白金少林拳3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,318},{2,318}},
		},
	},
	baijinshaolin_2_1={ --白金少林棍1
		enhance_709_auto={
			{{1,0},{5,0},{6,1},{10,1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinshaolin_2_2={ --白金少林棍2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,319},{2,319}},
		},
	},
			baijinshaolin_2_3={ --白金少林棍3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,319},{2,319}},
		},
	},
	baijinshaolin_3_1={ --白金少林刀1
		enhance_709_auto={
			{{1,0},{5,0},{6,1},{10,1}},
			{{1,-1},{2,-1}}
		},
	},
		baijinshaolin_3_2={ --白金少林刀2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,321},{2,321}},
		},
	},
			baijinshaolin_3_3={ --白金少林刀3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,321},{2,321}},
		},
	},
	baijincuiyan_1_1={ --白金翠烟外1
		dec_percasttime={
			{{1,0},{5,0},{6,90},{10,90}},
			{{1,-1},{2,-1}},
			{{1,713},{10,713}},
		},
	},
		baijincuiyan_1_2={ --白金翠烟外2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,336},{2,336}},
		}
	},
			baijincuiyan_1_3={ --白金翠烟外3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,336},{2,336}},
		}
	},
	baijincuiyan_2_1={ --白金翠烟内1
		dec_percasttime={
			{{1,0},{5,0},{6,90},{10,90}},
			{{1,-1},{2,-1}},
			{{1,713},{10,713}},
		},
	},
		baijincuiyan_2_2={ --白金翠烟内2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,337},{2,337}},
		},
	},
			baijincuiyan_2_3={ --白金翠烟内3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,337},{2,337}},
		},
	},
	baijintianwang_1_1={ --白金天王枪1
		enhance_708_life_p={
			{{1,0},{5,0},{6,10},{10,10}},
			{{1,-1},{2,-1}}
		},
	},
		baijintianwang_1_2={ --白金天王枪2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,323},{2,323}},
		},
	},
			baijintianwang_1_3={ --白金天王枪3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,323},{2,323}},
		},
	},
	baijintianwang_2_1={ --白金天王锤1
		enhance_708_life_p={
			{{1,0},{5,0},{6,10},{10,10}},
			{{1,-1},{2,-1}}
		},
	},
		baijintianwang_2_2={ --白金天王锤2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,325},{2,325}},
		},
	},
			baijintianwang_2_3={ --白金天王锤3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,325},{2,325}},
		},
	},
	baijintianwang_3_1={ --白金天王刀1
		enhance_708_life_p={
			{{1,0},{5,0},{6,10},{10,10}},
			{{1,-1},{2,-1}}
		},
	},
		baijintianwang_3_2={ --白金天王刀2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,322},{2,322}},
		},
	},
			baijintianwang_3_3={ --白金天王刀3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,322},{2,322}},
		},
	},
	baijintangmen_1_1={ --白金唐门飞刀1
		dec_percasttimehorse={
			{{1,0},{5,0},{6,36*256+18},{10,36*256+18}},
			{{1,-1},{2,-1}},
			{{1,710},{10,710}},
		},
	},
		baijintangmen_1_2={ --白金唐门飞刀2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,339},{2,339}},
		},
	},
			baijintangmen_1_3={ --白金唐门飞刀3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,339},{2,339}},
		},
	},
	baijintangmen_2_1={ --白金唐门镖1
		dec_percasttimehorse={
			{{1,0},{5,0},{6,36*256+18},{10,36*256+18}},
			{{1,-1},{2,-1}},
			{{1,710},{10,710}},
		},
	},
		baijintangmen_2_2={ --白金唐门镖2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,342},{2,342}},
		},
	},
			baijintangmen_2_3={ --白金唐门镖3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,342},{2,342}},
		},
	},
	baijintangmen_3_1={ --白金唐门暗器1
		dec_percasttimehorse={
			{{1,0},{5,0},{6,36*256+18},{10,36*256+18}},
			{{1,-1},{2,-1}},
			{{1,710},{10,710}},
		},
	},
		baijintangmen_3_2={ --白金唐门暗器2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,302},{2,302}},
		},
	},
			baijintangmen_3_3={ --白金唐门暗器3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,302},{2,302}},
		},
	},
	baijinwudu_1_1={ --白金五毒刀1
		enhance_711_auto={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}}
		},
	},
		baijinwudu_1_2={ --白金五毒刀2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,355},{2,355}},
		},
	},
			baijinwudu_1_3={ --白金五毒刀3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,355},{2,355}},
		},
	},
	baijinwudu_2_1={ --白金五毒掌1
		enhance_711_auto={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}}
		},
	},
		baijinwudu_2_2={ --白金五毒掌2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,353},{2,353}},
		},
	},
			baijinwudu_2_3={ --白金五毒掌3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,353},{2,353}},
		},
	},
	baijinemei_1_1={ --白金峨嵋剑1
		enhance_93_life_v={
			{{1,0},{5,0},{6,300},{10,300}},
			{{1,-1},{2,-1}}
		},
	},
		baijinemei_1_2={ --白金峨嵋剑2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,328},{2,328}},
		},
	},
			baijinemei_1_3={ --白金峨嵋剑3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,328},{2,328}},
		},
	},
	baijinemei_2_1={ --白金峨嵋掌1
		enhance_93_life_v={
			{{1,0},{5,0},{6,300},{10,300}},
			{{1,-1},{2,-1}}
		},
	},
		baijinemei_2_2={ --白金峨嵋掌2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,380},{2,380}},
		},
	},
			baijinemei_2_3={ --白金峨嵋掌3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,380},{2,380}},
		},
	},
	baijingaibang_1_1={ --白金丐帮棍1
		enhance_714_auto={
			{{1,0},{5,0},{6,2},{10,2}},
			{{1,-1},{2,-1}}
		},
	},
		baijingaibang_1_2={ --白金丐帮棍2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,359},{2,359}},
		},
	},
			baijingaibang_1_3={ --白金丐帮棍3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,359},{2,359}},
		},
	},
	baijingaibang_2_1={ --白金丐帮掌1
		enhance_714_auto={
			{{1,0},{5,0},{6,2},{10,2}},
			{{1,-1},{2,-1}}
		},
	},
		baijingaibang_2_2={ --白金丐帮掌2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,357},{2,357}},
		},
	},
			baijingaibang_2_3={ --白金丐帮掌3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,357},{2,357}},
		},
	},
	baijinwudang_1_1={ --白金武当剑1
		dec_percasttime={
			{{1,0},{5,0},{6,54},{10,54}},
			{{1,-1},{2,-1}},
			{{1,716},{10,716}},
		},
	},
		baijinwudang_1_2={ --白金武当剑2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,368},{2,368}},
		},
	},
			baijinwudang_1_3={ --白金武当剑3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,368},{2,368}},
		},
	},
	baijinwudang_2_1={ --白金武当气1
		dec_percasttime={
			{{1,0},{5,0},{6,54},{10,54}},
			{{1,-1},{2,-1}},
			{{1,716},{10,716}},
		},
	},
		baijinwudang_2_2={ --白金武当气2
		allskill_v={{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,365},{2,365}},
		},
	},
			baijinwudang_2_3={ --白金武当气3
		allskill_v={{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,365},{2,365}},
		},
	},
	baijinkunlun_1_1={ --白金昆仑剑1
		enhance_717_auto={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}}
		},
	},
		baijinkunlun_1_2={ --白金昆仑剑2
		allskill_v={{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,375},{2,375}},
		},
	},
			baijinkunlun_1_3={ --白金昆仑剑3
		allskill_v={{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,375},{2,375}},
		},
	},
	baijinkunlun_2_1={ --白金昆仑刀1
		enhance_717_auto={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}},
		},
	},
		baijinkunlun_2_2={ --白金昆仑刀2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,372},{2,372}}
		},
	},
			baijinkunlun_2_3={ --白金昆仑刀3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,372},{2,372}}
		},
	},
	baijintianren_1_1={ --白金天忍战1
		enhance_723_miss_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}},
		},
	},
		baijintianren_1_2={ --白金天忍战2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,361},{2,361}}
		},
	},
			baijintianren_1_3={ --白金天忍战3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,361},{2,361}}
		},
	},
	baijintianren_2_1={ --白金天忍魔1
		enhance_723_miss_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{2,-1}}
		},
	},
		baijintianren_2_2={ --白金天忍魔2
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,362},{2,362}},
		},
	},
			baijintianren_2_3={ --白金天忍魔3
		allskill_v={
			{{1,0},{9,0},{10,1},{11,1}},
			{{1,-1},{2,-1}},
			{{1,362},{2,362}},
		},
	},
		baijinxue1={ --白金加血20%1
		lifemax_p={
		{{1,0},{5,0},{6,20},{10,20}},
		{{1,-1},{30,-1}},
		},
	},
			baijinxue2={ --白金加血20%2
		lifemax_p={
		{{1,0},{5,0},{6,20},{10,20}},
		{{1,-1},{30,-1}},
		},
	},
			baijinxue3={ --白金加血20%3
		lifemax_p={
		{{1,0},{5,0},{6,20},{10,20}},
		{{1,-1},{30,-1}},
		},
	},
		baijinnei1={ --白金加内20%1
		manamax_p={
		{{1,0},{5,0},{6,20},{10,20}},
		{{1,-1},{30,-1}},
		},
	},
			baijinnei2={ --白金加内20%2
		manamax_p={
		{{1,0},{5,0},{6,20},{10,20}},
		{{1,-1},{30,-1}},
		},
	},
	baijindixiaoshanghai_1={	-- 白金抵消一定百分比的伤害，包括毒伤害等
		sorbdamage_p={
			{{1,0},{9,0},{10,60},{11,60}},
			{{1,-1},{30,-1}},
		}
	},
	baijinquankang_1={
		allres_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{30,-1}},
		},
	},
	
	baijindixiaoshanghai_2={	-- 白金抵消一定百分比的伤害，包括毒伤害等
		sorbdamage_p={
			{{1,0},{9,0},{10,60},{11,60}},
			{{1,-1},{30,-1}},
		}
	},
	baijinquankang_2={
		allres_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{30,-1}},
		},
	},
	
	baijindixiaoshanghai_3={	-- 白金抵消一定百分比的伤害，包括毒伤害等
		sorbdamage_p={
			{{1,0},{9,0},{10,60},{11,60}},
			{{1,-1},{30,-1}},
		}
	},
	baijinquankang_3={
		allres_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{30,-1}},
		},
	},
	
	baijindixiaoshanghai_4={	-- 白金抵消一定百分比的伤害，包括毒伤害等
		sorbdamage_p={
			{{1,0},{9,0},{10,60},{11,60}},
			{{1,-1},{30,-1}},
		}
	},
	baijinquankang_4={
		allres_p={
			{{1,0},{5,0},{6,5},{10,5}},
			{{1,-1},{30,-1}},
		},
	},
}
-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end

	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
	return Param1..","..Param2..","..Param3
end;

