Include("\\script\\skill\\head.lua")
SKILLS={
	menghuxiaoya1={ --当角色击中敌人，有5%概率在5秒使敌人攻击技能加成-25%,CD1秒
		autoattackskill={{{1,1457*256 + 1},{20,1457*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 5},{20,1*18*256 + 5}}},
					},
	menghuxiaoya_zuzhou1={
		skill_enhance={
			[1]={{1,-25},{20,-25}},
			[2]={{1,18*5},{20,18*5}}
									},
								},
	menghuxiaoya2={ --当角色击中敌人，有5%概率在5秒使敌人攻击技能加成-25%,CD1秒
		autoattackskill={{{1,1459*256 + 1},{20,1459*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 5},{20,1*18*256 + 5}}},
					},
	menghuxiaoya_zuzhou2={
		skill_enhance={
			[1]={{1,-25},{20,-25}},
			[2]={{1,18*5},{20,18*5}}
									},
								},
	menghuxiaoya3={ --当角色击中敌人，有5%概率在5秒使敌人攻击技能加成-25%,CD1秒
		autoattackskill={{{1,1461*256 + 1},{20,1461*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 5},{20,1*18*256 + 5}}},
					},
	menghuxiaoya_zuzhou3={
		skill_enhance={
			[1]={{1,-25},{20,-25}},
			[2]={{1,18*5},{20,18*5}}
									},
								},
	menghuxiaoya4={ --当角色击中敌人，有5%概率在5秒使敌人攻击技能加成-25%,CD1秒
		autoattackskill={{{1,1463*256 + 1},{20,1463*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 5},{20,1*18*256 + 5}}},
					},
	menghuxiaoya_zuzhou4={
		skill_enhance={
			[1]={{1,-25},{20,-25}},
			[2]={{1,18*5},{20,18*5}}
									},
								},
	menghuxiaoya5={ --当角色击中敌人，有5%概率在5秒使敌人攻击技能加成-25%,CD1秒
		autoattackskill={{{1,1465*256 + 1},{20,1465*256 + 20}},{{1,-1},{20,-1}},{{1,1*18*256 + 5},{20,1*18*256 + 5}}},
					},
	menghuxiaoya_zuzhou5={
		skill_enhance={
			[1]={{1,-25},{20,-25}},
			[2]={{1,18*5},{20,18*5}}
									},
								},
}
