
-- ====================== 文件信息 ======================

-- 剑侠情缘online 写入服务器日志脚本
-- Edited by peres
-- 2005/04/28 PM 15:01

-- 如果有过幸福
-- 幸福只是瞬间的片断
-- 一小段一小段
-- 房间里的黑暗就犹如大海
-- 童年的时候她和父母一起坐船去海岛
-- 夜晚的船在风浪里颠簸
-- 她躺在小小的铺位上感觉自己随着潮水漂向世界的尽头
-- 而那一刻
-- 世界是不存在的
-- 只有他和她两个人
-- 他们相爱

-- ======================================================

Include("\\script\\lib\\mem.lua");

CWriteLog = {

-- ===============================
-- new 构造函数
-- 参数一：是否每天写，1、为按照日期名建立文件，2、为固定写入 log.txt
-- 参数二：需要写日志的事件名称，也就是目录名
-- ===============================

	__new = function(self, arg)
		if (not arg) then return end;
		
		if arg[1]==1 then
			-- 文件名等于日期名
			self.__filename = "Logs/"..arg[2].."_"..date("%y%m%d")..".txt";
		else
			self.__filename = "Logs/"..arg[2].."_".."log.txt"; -- 固定一个文件名
		end;
		
	end,


-- ===============================
-- writelog 将一组字符串当作一行写入 log 文件
-- 参数一：需要写入的字符串，自动在行前添加写入的日期
-- ===============================

	writelog = function(self, arg)
	
		local fh = openfile(self.__filename, "a");
		
		write(fh, date("%y%m%d%H%M%S").."\t"..tostring(arg).."\n");
		
		closefile(fh);
	
	end

}