
-- ====================== ÎÄ¼þÐÅÏ¢ ======================

-- ½£ÏÀÇéÔµonline IB °æ±¾ÏÞÖÆÍÐ¹ÜµÄÍ·ÎÄ¼þ
-- Edited by peres
-- 2006/10/30 PM 15:42

-- ÑÌ»¨¡£ÄÇÒ»Ò¹µÄÑÌ»¨¡£
-- Ëý¼ÇµÃËûÔÚ´óÓêµÄÈËÈºÖÐ£¬Õ¾ÔÚËýµÄ±³ºóÓµ±§×¡Ëý¡£
-- ËûÎÂÅ¯µÄÆ¤·ô£¬ËûÊìÏ¤µÄÎ¶µÀ¡£ÑÌ»¨ÕÕÁÁËýµÄÑÛ¾¦¡£
-- Ò»ÇÐÎÞ¿ÉÍì»Ø¡­¡­

-- ======================================================

NUM_OFFLINE_PERMITREGION_MAX = 10;  -- Àë²»ÔÊÐíÍÐ¹ÜµãµÄ×îÐ¡°ë¾¶

aryLimitRegion = {
	--BiÖn Kinh
	[37]={
		{1630, 3187},--NPC Xa Phu	
		{1704, 3224},--NPC Xa Phu	
		{1595, 2994},--NPC Xa Phu	
		{1860, 2928},--NPC Xa Phu	
		{1755, 3043},--Vâ L©m TruyÒn nh©n	
		{1806, 3098},--LÔ Quan	
		{1712, 3102},--Thî rÌn	
		{1747, 3050},--Thî rÌn	
		{1773, 3090},--D­îc §iÕm	
		{1786, 3103},--TiÖm T¹p Hãa	
		{1776, 3063},--Sø Gi¶ KiÖt XuÊt	
		{1740, 3065},--ThÝ LuyÖn §­êng	
		{1646, 3050},--NhiÕp ThÝ TrÇn	
		{1589, 3096},--Hµng Rong	
		{1784, 3042},--Néi C¸c Th­îng Th­	
		{1641, 3145},--B×nh B×nh C« N­¬ng	
		{16620, 3019},--B×nh B×nh C« N­¬ng	
		{1713, 374},--B×nh B×nh C« N­¬ng	
		{1865, 2968},--B×nh B×nh C« N­¬ng	
		{1734, 3102},--D· TÈu	
		{1693, 3212},--Xa Phu C«ng Thµnh	
	},

	--§¹i Lý
	[162]={
		{1669, 3124},--NPC Xa Phu	
		{1697, 3279},--NPC Xa Phu	
		{1469, 3269},--NPC Xa Phu	
		{1628, 3184},--Vâ L©m TruyÒn nh©n	
		{1587, 3221},--LÔ Quan	
		{15599, 3262},--Thî rÌn	
		{1449, 3211},--D­îc §iÕm	
		{1535, 3201},--TiÖm T¹p Hãa	
		{1651, 3226},--Sø Gi¶ Liªn §Êu	
		{1613, 3190},--ThÝ LuyÖn §­êng	
		{1574, 3227},--NhiÕp ThÝ TrÇn	
		{1671, 3236},--Hµng Rong	
		{1651, 3226},--D· TÈu	
		{1681, 3276},--Xa Phu C«ng Thµnh	
	},

	--T­¬ng D­¬ng
	[78] = {
		{1509, 3140},--NPC Xa Phu	
		{1439, 3212},--NPC Xa Phu	
		{1598, 3378},--NPC Xa Phu	
		{1693, 3233},--NPC Xa Phu	
		{1609, 3259},--Vâ L©m TruyÒn nh©n	
		{1541, 3247},--LÔ Quan	
		{1550, 3217},--Thî rÌn	
		{1612, 3244},--D­îc §iÕm	
		{1628, 3262},--TiÖm T¹p Hãa	
		{1546, 3118},--Sø Gi¶ KiÖt XuÊt	
		{1606, 3238},--ThÝ LuyÖn §­êng	
		{1511, 3208},--NhiÕp ThÝ TrÇn	
		{1489, 3270},--Hµng Rong	
		{1594, 3289},--D· TÈu	
		{1582, 3379},--Xa Phu C«ng Thµnh	
		{1554, 3183},--ThÇn BÝ th­¬ng nh©n			
	},

	--Thµnh §«
	[11]={
		{3196, 5194},--NPC Xa Phu	
		{3266, 5003},--NPC Xa Phu	
		{3027, 4960},--NPC Xa Phu	
		{3017, 5090},--NPC Xa Phu	
		{3135, 5045},--Vâ L©m TruyÒn nh©n	
		{3126, 4994},--LÔ Quan	
		{3104, 5121},--Thî rÌn	
		{3141, 5136},--D­îc §iÕm	
		{3095, 5136},--TiÖm T¹p Hãa	
		{3213, 5148},--Sø Gi¶ Liªn ®Êu	
		{3109, 5059},--ThÝ LuyÖn §­êng	
		{3210, 4974},--NhiÕp ThÝ TrÇn	
		{3180, 4947},--Hµng Rong	
		{3153, 5066},--D· TÈu	
		{3185, 5182},--Xa Phu C«ng Thµnh	
	},
	
	--D­¬ng Ch©u
	[80]={
		{1717, 3198},--NPC Xa Phu	
		{1592, 3195},--NPC Xa Phu	
		{1670, 2991},--NPC Xa Phu	
		{1825, 3064},--NPC Xa Phu	
		{1792, 3047},--Vâ L©m TruyÒn nh©n	
		{1745, 3000},--LÔ Quan	
		{1689, 3170},--Thî rÌn	
		{1773, 3079},--D­îc §iÕm	
		{1701, 3022},--TiÖm T¹p Hãa	
		{1754, 3035},--Sø Gi¶ Liªn ®Êu	
		{1705, 3058},--ThÝ LuyÖn §­êng	
		{1702, 2962},--NhiÕp ThÝ TrÇn	
		{1638, 3049},--Hµng Rong	
		{1743, 2966},--D· TÈu	
		{1691, 3219},--Xa Phu C«ng Thµnh	
	},
	
	--Ph­îng T­êng
	[1]={
		{1647, 3166},--NPC Xa Phu	
		{1557, 3108},--NPC Xa Phu	
		{1520, 3230},--NPC Xa Phu	
		{1652, 3281},--NPC Xa Phu	
		{1623, 3205},--Vâ L©m TruyÒn nh©n	
		{1614, 3152},--LÔ Quan	
		{1618, 3196},--Thî rÌn	
		{1604, 3190},--D­îc §iÕm	
		{1559, 3206},--TiÖm T¹p Hãa	
		{1671, 3218},--Sø Gi¶ Liªn ®Êu	
		{1586, 3229},--ThÝ LuyÖn §­êng	
		{1507, 3198},--NhiÕp ThÝ TrÇn	
		{1619, 3103},--Hµng Rong	
		{1618, 3090},--D· TÈu	
		{1640, 3270},--Xa Phu C«ng Thµnh	
	},
	
	--L©m An
	[176]={
		{1606, 3292},--NPC Xa Phu	
		{1372, 3329},--NPC Xa Phu	
		{1601, 2912},--NPC Xa Phu	
		{1353, 3014},--NPC Xa Phu	
		{1532, 3010},--Vâ L©m TruyÒn nh©n	
		{1506, 2984},--LÔ Quan	
		{1683, 3220},--Thî rÌn	
		{1332, 3060},--Thî rÌn	
		{1520, 2986},--Thî rÌn	
		{1685, 3319},--D­îc §iÕm	
		{1474, 3362},--D­îc §iÕm	
		{1544, 2964},--D­îc §iÕm	
		{1615, 2977},--D­îc §iÕm	
		{1340, 3165},--TiÖm T¹p Hãa	
		{1457, 3259},--Sø Gi¶ KiÖt XuÊt	
		{1592, 2944},--ThÝ LuyÖn §­êng	
		{1371, 3007},--NhiÕp ThÝ TrÇn	
		{1387, 2961},--Hµng Rong	
		{1561, 2980},--D· TÈu	
		{1689, 3291},--Xa Phu C«ng Thµnh	
		{1654, 3263},--Ch­ëng §»ng Cung N÷	
		{1439, 3268},--Ch­ëng §»ng Cung N÷	
		{1384, 2979},--Ch­ëng §»ng Cung N÷	
		{1576, 2958},--Ch­ëng §»ng Cung N÷	
		{1314, 3195},--Thî rÌn ThÊn bÝ	
		{1412, 3312},--Vâ L©m Minh Chñ	
		{1442, 3061},--Chñ TiÒn Trang	
		{1478, 3237},--Néi C¸c Th­îng Th­	
		{1312, 2848},--ThÊn BÝ Th­¬ng Nh©n	
		{1657, 3261},--Ch­ëng §¨ng Cung N÷
		{1577, 2957},--Ch­ëng §¨ng Cung N÷
		{1439, 3267},--Ch­ëng §¨ng Cung N÷
		{1385, 2977},--Ch­ëng §¨ng Cung N÷
	},
	
	--Ba L¨ng HuyÖn
	[53]={
		{1626, 3172},--D· TÈu	
		{1629, 3195},--LÔ Quan	
		{1598, 3209},--HiÖu Thuèc	
		{1600, 3170},--T¹p Hãa	
		{1578, 3236},--Xa Phu	
	},
	
	--Giang T©n Th«n
	[20]={
		{3538, 6231},--D· TÈu	
		{3552, 6192},--LÔ Quan	
		{3469, 6164},--HiÖu Thuèc	
		{3370, 6256},--T¹p Hãa	
		{3458, 6110},--Xa Phu	
		{3522, 6117},--NguyÖt L·o	
	},
	
	--VÜnh L¹c
	[99]={
		{1646, 3192},--D· TÈu	
		{1614, 3177},--LÔ Quan	
		{1595, 3227},--HiÖu Thuèc	
		{1606, 3282},--T¹p Hãa	
		{1630, 3304},--Xa Phu	
		{1607, 3161},--	
	},
	
	--Chu Tiªn TrÊn
	[100]={
		{1616, 3199},--D· TÈu	
		{1621, 3181},--LÔ Quan	
		{1657, 3124},--HiÖu Thuèc	
		{1641, 3126},--T¹p Hãa	
		{1610, 3097},--Xa Phu	
		{1678, 3101},--Xa Phu	
		{1719, 3217},--Xa Phu	
		{1603, 3168},--Xa Phu	
	},
	
	--§¹o H­¬ng Th«n
	[101]={
		{1677, 3143},--D· TÈu	
		{1671, 3172},--LÔ Quan	
		{1679, 3196},--HiÖu Thuèc	
		{1639, 3144},--T¹p Hãa	
		{1623, 3098},--Xa Phu	
	},
	
	--Long M«n TrÊn
	[121]={
		{1959, 4500},--D· TÈu	
		{1958, 4517},--LÔ Quan	
		{1934, 4551},--HiÖu Thuèc	
		{1914, 4524},--T¹p Hãa	
		{1924, 4527},--Xa Phu	
		{1980, 4593},--Xa Phu
	},
	
	--Th¹ch Cæ TrÊn
	[123]={
		{1643, 3235},--D· TÈu	
		{1606, 3227},--LÔ Quan	
		{1600, 3209},--HiÖu Thuèc	
		{1630, 3231},--T¹p Hãa	
		{1658, 3244},--Xa Phu	
	},
	
	--Long TuyÒn Th«n
	[174]={
		{1608, 3200},--D· TÈu	
		{1631, 3215},--LÔ Quan	
		{1572, 3253},--HiÖu Thuèc	
		{1566, 3202},--T¹p Hãa	
		{1634, 3196},--Xa Phu	
	},
--	-- ÁÙ°²
--	[176]={
--		{1695, 3294},
--		{1373, 3333},
--		{1353, 3018},
--		{1602, 2912},
--		{1687, 3319},
--		{1476, 3363},
--		{1545, 2966},
--		{1615, 2976},
--		{1340, 3166},
--		{1505, 2982},
--	},
--
--	-- ãê¾©
--	[37]={
--		{1704, 3222},
--		{1632, 3185},
--		{1595, 2995},
--		{1862, 2927},
--		{1785, 3104},
--		{1773, 3091},
--		{1806, 3097},
--	},
--
--	-- ³É¶¼
--	[11]={
--		{3196, 5193},
--		{3018, 5089},
--		{3029, 4958},
--		{3261, 5004},
--		{3095, 5135},
--		{3141, 5134},
--		{3126, 4993},
--	},
--
--	-- ´óÀí
--	[162]={
--		{1667, 3126},
--		{1468, 3271},
--		{1697, 3277},
--		{1535, 3202},
--		{1500, 3213},
--		{1586, 3221}
--	},
--	
--	-- ÏåÑô
--	[78]={
--		{1596, 3379},
--		{1439, 3214},
--		{1511, 3142},
--		{1689, 3236},
--		{1628, 3263},
--		{1612, 3245},
--		{1539, 3248},
--	},	
--
--	-- ·ïÏè
--	[1]={
--		{1651, 3279},
--		{1520, 3228},
--		{1557, 3108},
--		{1647, 3167},
--		{1559, 3206},
--		{1603, 3191},
--		{1614, 3151},
--	},	
--
--	-- ÑïÖÝ
--	[80]={
--		{1718, 3201},
--		{1593, 3197},
--		{1669, 2990},
--		{1824, 3064},
--		{1691, 3169},
--		{1702, 3022},
--		{1743, 2995},
--	},	
--	
--	-- ÄÏÔÀÕò
--	[54]={
--		{1590, 3092},
--		{1639, 3142},
--		{1648, 3108},
--	},
--		
--	-- ÁúÈª´å
--	[174]={
--		{1635, 3198},
--		{1594, 3228},
--		{1572, 3254},
--		{1631, 3216},
--	},
--	
--	-- ½­½ò´å
--	[20]={
--		{3459, 6113},
--		{3468, 6163},
--		{3370, 6255},
--		{3552, 6192},
--	},
--
--	-- ÁúÃÅÕò
--	[121]={
--		{1925, 4427},
--		{1980, 4595},
--		{1914, 4524},
--		{1934, 4551},
--		{1957, 4518},
--	},
--
--	-- Ê¯¹ÄÕò
--	[153]={
--		{1631, 3179},
--		{1684, 3244},
--		{1600, 3209},
--		{1634, 3223},
--		{1606, 3228},
--	},
--	
--	-- µ¾Ïã´å
--	[101]={
--		{1622, 3099},
--		{1679, 3196},
--		{1639, 3144},
--		{1671, 3173},
--	},
--	
--	-- ÓÀÀÖÕò
--	[99]={
--		{1608, 3163},
--		{1630, 3305},
--		{1595, 3227},
--		{1606, 3282},
--		{1614, 3177},
--	},
--	
--	-- ÖìÏÉÕò
--	[100]={
--		{1603, 3170},
--		{1611, 3099},
--		{1679, 3102},
--		{1720, 3217},
--		{1641, 3126},
--		{1657, 3124},
--		{1621, 3181},
--	},
--	
--	-- °ÍÁêÏØ
--	[53]={
--		{1579, 3236},
--		{1598, 3209},
--		{1600, 3170},
--		{1629, 3195},
--	},
}


-- ¼ì²âÍæ¼ÒÊÇ·ñÔÚÏÞÖÆÇøÓòÄÚ
function offlineCheckPermitRegion()
	local nMapId, nX, nY = GetWorldPos();
	local nLimitX, nLimitY = 0,0;
	local szDirection, nDistance = "", 0;
	local i=0;
	if aryLimitRegion[nMapId] then
		for i=1, getn(aryLimitRegion[nMapId]) do
			nLimitX = aryLimitRegion[nMapId][i][1];
			nLimitY = aryLimitRegion[nMapId][i][2];
			szDirection, nDistance = getDirection({nX, nY}, {nLimitX, nLimitY});
			-- Èç¹û¾àÀëÈÎºÎÒ»µãÐ¡ÓÚ 10£¬ÔòËµÃ÷ÔÚ½ûÖ¹ÇøÓòÄÚ
			if nDistance<=NUM_OFFLINE_PERMITREGION_MAX then
				return 0;
			end;
		end;
		return 1;
	else
		return 1;
	end;
end;


function StallCheckPermitRegion()
	if offlineCheckPermitRegion() == 1 then
		return 1
	else
		Talk(1, "", "Kh«ng thÓ bµy b¸n t¹i khu vùc nµy")
	end
end

-- »ñµÃÒ»¸öÎ»ÖÃÏà¶ÔÓÚÍæ¼ÒÎ»ÖÃµÄ´óÌå·½Î»
function getDirection(posOrigin, posTarget)
	
	local tbStr = {"T©y Nam", "Nam", "§«ng Nam", "§«ng", "§«ng B¾c", "b¾c ", "T©y B¾c", "T©y"};
	
	local nX	= posOrigin[2] - posTarget[2];
	local nY	= posTarget[1] - posOrigin[1];
	
	local nDeg	= atan2(posOrigin[2] - posTarget[2], posTarget[1] - posOrigin[1]);
	local nDirection = floor(nDeg/45+4.5);
	
	if (nDirection == 0) then
		nDirection = 8;
	end;
	
	-- ¾ßÌåµÄ¾àÀë£¬È¡ÕûÊý
	local nDistance = floor(sqrt(nX*nX + nY*nY));
	
	return tbStr[nDirection], nDistance;
	
end;
