--Create by GGH
--°Ë±¦Ê²½õôÕ×Ó

--Ê²½õôÕ×Ó=ºìÔæ2+Àõ×Ó2+ôÕÒ¶2+µ¾Ã×2+ÖíÈâ2+Å£Èâ2(Ôö¼Ó1,000µÄ¾­Ñé,³É¹¦ÂÊ50£¥)
--ÃÛ½¤Ê²½õôÕ×Ó£½Ê²½õôÕ×Ó+ÈÎÒâôÕ×ÓÔ­ÁÏ1(Ôö¼Ó5,000µÄ¾­Ñé,³É¹¦ÂÊ50£¥)
--°Ë±¦Ê²½õôÕ×Ó£½ÃÛ½¤Ê²½õôÕ×Ó+ÈÎÒâôÕ×ÓÔ­ÁÏ1(Ôö¼Ó30,000µã¾­Ñé,³É¹¦ÂÊ30£¥)
--°Ù¹ûÊ²½õôÕ×Ó£½°Ë±¦Ê²½õôÕ×Ó+ÈÎÒâôÕ×ÓÔ­ÁÏ1(Ôö¼Ó100,000µã¾­Ñé,³É¹¦ÂÊ20£¥)
--Ë®¾§Ê²½õôÕ×Ó£½°Ù¹ûÊ²½õôÕ×Ó+ÈÎÒâôÕ×ÓÔ­ÁÏ1(Ôö¼Ó500,000µãµÄ¾­Ñé,³É¹¦ÂÊ10£¥)
--ÇüÔ­Ê²½õôÕ×Ó£½Ë®¾§Ê²½õôÕ×Ó+ÈÎÒâôÕ×ÓÔ­ÁÏ1(Ôö¼Ó1£¬000,000,000µã¾­Ñé,³É¹¦ÂÊ3£¥)
--»ñµÃÌõ¼ş£º
--1¡¢²ÄÁÏÆëÈ«
--2¡¢1000Á½Òø×Ó
--¼Ó¹¤Ìõ¼ş£º·ÇÇüÔ­Ê²½õôÕ×ÓÒÔÍâµÄ¸÷ÖÖÊ²½õôÕ×ÓºÍÈÎÒ»ôÕ×ÓÔ­ÁÏ£»1000Á½Òø×Ó
--Ê§°Ü½á¹û£º»ñµÃÊ²½õôÕ×Ó£¨ÎŞÂÛÄã¼Ó¹¤Ç°ÊÇÊ²Ã´Ê²½õôÕ×Ó£©£¬¼Ó¹¤ÓÃôÕ×Ó²ÄÁÏÏûÊ§£¬²»·µ»¹1000Á½Òø×Ó¡£
--ÏŞÖÆËµÃ÷£º»î¶¯½áÊøÊ±¹¦Ğ§ÏûÊ§£¨¼´±äÖÊ£©£¬Ã¿ÔÚÏßÒ»Ğ¡Ê±Ö»ÄÜ³ÔÒ»¸ö£¬Ò»¸ö½ÇÉ«³Ô³¬¹ı20,000,000µã¾­ÑéµÄ¸÷ÀàÊ²½õôÕ×ÓÖ®ºó¾Í²»ÄÜÔÙ³ÔÈÎºÎÊ²½õôÕ×Ó¡£


function main(sel)
firsttime = GetTask(139)
num = GetTask(138)
msg={	     "B¹n ®· ¨n rÊt nhiÒu b¸nh ch­ng, kh«ng thÓ ¨n thªm ®­îc n÷a ",
	     "B¹n ®¹t ®­îc 30.000 ®iÓm kinh nghiÖm! ",
	     "B¹n c¶m thÊy rÊt no, ph¶i ®îi thªm chót n÷a míi cã thÓ ¨n b¸nh ch­ng! ",
		 "B¹n ®· ¨n rÊt nhiÒu b¸nh ch­ng, ®©y lµ c¸i cuèi cïng "
	    }



	if(num > 20000000)  then   --Ê¹ÓÃ¾­Ñé´óÓÚ20,000,000£¬²»ÄÜÔÙ³Ô
		Msg2Player(msg[1])
		return 1
	else
		if (GetGameTime() > firsttime + 60 * 60) then
			AddOwnExp(30000)  --¾­ÑéÖµÔö¼Ó30000
			Msg2Player(msg[2])
			SetTask(138,num+30000)
			SetTask(139, GetGameTime())  --¼ÇÂ¼µ±Ç°ÔÚÏßÊ±¼ä
			if(GetTask(138)>20000000) then
				Msg2Player(msg[4])
			end
			return 0
		elseif  (firsttime == 0) then
			AddOwnExp(30000)  --¾­ÑéÖµÔö¼Ó30000
			Msg2Player(msg[2])
			SetTask(138,num+30000)
			SetTask(139, GetGameTime())  --¼ÇÂ¼µ±Ç°ÔÚÏßÊ±¼ä
			if(GetTask(138)>20000000) then
				Msg2Player(msg[4])
			end
			return 0	
		else
			Msg2Player(msg[3])
			return 1
		end

	end
end