TB_DAIYITOUSHI_FACTS = 
	{
		{-- ÉÙÁÖ
			szFacName		=	"shaolin",	nFacNumb	=	0,	nCamp	=	1,	nRankId	=	72,	nSeries	=	0,
			nTaskId_Fact	=	7,
			nTaskId_90Skill	=	122,
			nTaskId_137 	=	137,		nValue_137	=	67,
			tbSkillID		=	{
							[10]	=	{
											14,		-- ÐÐÁú²»Óê[14]
											8,		-- ½ð¸Õ·üÄ§[10]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											10,		-- ÉÙÁÖÈ­·¨[8]
											4,		-- ÉÙÁÖ¹÷·¨[4]£¨10¼¶£©
											6,		-- ÉÙÁÖµ¶·¨[6]£¨10¼¶£©
										},
										
							[30]	=	{
											15,		-- ²»¶¯Ã÷Íõ[15]£¨20¼¶£©
										},
										
							[40]	=	{
											16,		-- ÂÞººÕó[16]£¨30¼¶£©
										},
										
							[50]	=	{
											20,		-- Ê¨×Óºð [20]£¨40¼¶£©
										},
										
							[60]	=	{
											271,	-- Áú×¦»¢×¥[271]
											11,		-- ºáÉ¨ÁùºÏ [11]£¨50¼¶£©
											19,		-- Ä¦Ú­ÎÞÁ¿ [19]£¨50¼¶£©
											273,		-- Ä¦Ú­ÎÞÁ¿ [19]£¨50¼¶£©
											21,		-- Ä¦Ú­ÎÞÁ¿ [19]£¨50¼¶£©

										},
							[90]	=	{
											{318, 1, "QuyÒn ph¸p"},--dat ma ®é giang
										},

										
						},
			szMsg = "KÓ tõ h«m nay %s gia nhËp m«n ph¸i ThiÕu L©m, sau nµy nhê c¸c huynh chØ gi¸o!",
		},	
		
		{-- ÌìÍõ
			szFacName		=	"tianwang",	nFacNumb	=	1,	nCamp	=	3,	nRankId	=	69,	nSeries	=	0,
			nTaskId_Fact	=	3,
			nTaskId_90Skill	=	121,
			nTaskId_137		=	137,		nValue_137	=	63,
			tbSkillID		=	{
							[10]	=	{
											34,		-- ¾ªÀ×Õ¶[34]  £¨ÈëÃÅ£©
											30,		-- »Ø·çÂäÑã[30]£¨ÈëÃÅ£©
											29,		-- Õ¶Áú¾÷[29]  £¨ÈëÃÅ£©
										},
										
							[20]	=	{
											26,		-- ÌìÍõ´¸·¨[26]£¨10¼¶£©
											23,		-- ÌìÍõÇ¹·¨[23]£¨10¼¶£©
											24,		-- ÌìÍõµ¶·¨[24]£¨10¼¶£©
										},
										
							[30]	=	{
											33,		-- ¾²ÐÄ¾÷[33]  £¨20¼¶£©
										},
										
							[40]	=	{
											37,		-- ÆÃ·çÕ¶  [37]£¨30¼¶£©
											35,		-- Ñô¹ØÈýµþ[35]£¨30¼¶£©
											31,		-- ÐÐÔÆ¾÷  [31]£¨30¼¶£©
										},
										
							[50]	=	{
											40,		-- ¶Ï»ê´Ì  [40]£¨40¼¶£©
										},
										
							[60]	=	{
											42,		-- ½ðÖÓÕÖ  [42]£¨50¼¶£©
											36,		-- ½ðÖÓÕÖ  [42]£¨50¼¶£©
											32,		-- ½ðÖÓÕÖ  [42]£¨50¼¶£©
											41,		-- ½ðÖÓÕÖ  [42]£¨50¼¶£©
											324,

										},
								[90]	=	{
											{322, 1, "§ao ph¸p"},	--pha thiªn tr·m

										},

										
							
						},
			szMsg = "KÓ tõ h«m nay %s gia nhËp Thiªn V­¬ng, nhê c¸c s­ huynh chØ gi¸o!",
		},
		
		{-- ÌÆÃÅ
			szFacName		=	"tangmen",	nFacNumb	=	2,	nCamp	=	3,	nRankId	=	76,	nSeries	=	1,
			nTaskId_Fact	=	2,
			nTaskId_90Skill	=	123,
			nTaskId_137		=	137,	nValue_137	=	62,
			tbSkillID		=	{
							[10]	=	{
											45,		-- Åùö¨µ¯[45 ]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											43,		-- ÌÆÃÅ°µÆ÷[43 ]£¨10¼¶£©
											347,	-- µØÑæ»ð[347]£¨10¼¶£©
										},
										
							[30]	=	{
											303,	-- ¶¾´Ì¹Ç  [303]£¨20¼¶£©
										},
										
							[40]	=	{
											50,		-- ×·ÐÄ¼ý  [50 ]£¨30¼¶£©
											54,		-- ÂþÌì»¨Óê[54 ]£¨30¼¶£©
											47,		-- ¶á»êïÚ  [47 ]£¨30¼¶£©
											343,	-- ´©ÐÄ´Ì  [343]£¨30¼¶£©
										},
										
							[50]	=	{
											345,	-- º®±ù´Ì  [345]£¨40¼¶£©
										},
										
							[60]	=	{
											349,	-- À×»÷Êõ[349]£¨50¼¶£©
											48,	-- À×»÷Êõ[349]£¨50¼¶£©
											249,	-- À×»÷Êõ[349]£¨50¼¶£©
											58,	-- À×»÷Êõ[349]£¨50¼¶£©
											341,	-- À×»÷Êõ[349]£¨50¼¶£©

										},
							[90]	=	{
											{339, 1, "Phi §ao"},	-- NhiÕp hån nguyÖt ¶nh		
										},
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp §­êng m«n, c¶m phiÒn c¸c s­ huynh s­ tû chØ gi¸o!",
		},
		
		{-- Îå¶¾
			szFacName		=	"wudu",	nFacNumb	=	3,	nCamp	=	2,	nRankId	=	80,	nSeries	=	1,
			nTaskId_Fact	=	10,
			nTaskId_90Skill	=	124,
			nTaskId_137		=	137,	nValue_137	=	70,
			tbSkillID		=	{
							[10]	=	{
											63,		-- ¶¾É°ÕÆ  [63]£¨ÈëÃÅ£©
											65,		-- Ñªµ¶¶¾É±[65]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											62,		-- Îå¶¾ÕÆ·¨[62]£¨10¼¶£©
											60,		-- Îå¶¾µ¶·¨[60]£¨10¼¶£©
											67,		-- ¾ÅÌì¿ñÀ×[67]£¨10¼¶£©
										},
										
							[30]	=	{
											70,		-- ³àÑæÊ´Ìì[70]£¨20¼¶£©
											66,		-- ÔÓÄÑÒ©¾­[66]£¨20¼¶£©
										},
										
							[40]	=	{
											68,		-- ÓÄÚ¤÷¼÷Ã[68 ]£¨30¼¶£©
											384,	-- °Ù¶¾´©ÐÄ[384]£¨30¼¶£©
											64,		-- ±ùÀ¶Ðþ¾§[64 ]£¨30¼¶£©
											1029,		-- v« h×nh ®éc
										},
										
							[50]	=	{
											356,	-- ´©ÒÂÆÆ¼×  [356]£¨40¼¶£©
											73,		-- Íò¹ÆÊ´ÐÄ[73 ]£¨40¼¶£©
										},
										
							[60]	=	{
											72,		-- ´©ÐÄ¶¾´Ì[72]£¨50¼¶£©
											75,		-- ´©ÐÄ¶¾´Ì[75]£¨50¼¶£©
											71,		-- ´©ÐÄ¶¾´Ì[71]£¨50¼¶£©
											74,		-- ´©ÐÄ¶¾´Ì[74]£¨50¼¶£©

										},
							[90]	=	{
										{353, 1, "Ch­ëng ph¸p"},	-- ©m phong thùc cèt
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp m«n Ngò §éc gi¸o, c¶m phiÒn c¸c s­ huynh s­ tû chØ gi¸o!",
		},
		
		{-- ¶ëÃ¼
			szFacName		=	"emei",	nFacNumb	=	4,	nCamp	=	1,	nRankId	=	64,	nSeries	=	2,
			nTaskId_Fact	=	1,
			nTaskId_90Skill	=	125,
			nTaskId_137		=	137,	nValue_137 = 61,
			tbSkillID		=	{
							[10]	=	{
											85,		-- Ò»Ò¶ÖªÇï[85]£¨ÈëÃÅ£©
											80,		-- Æ®Ñ©´©ÔÆ[80]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											77,		-- ¶ëáÒ½£·¨[77]£¨10¼¶£©
											79,		-- ¶ëáÒÕÆ·¨[79]£¨10¼¶£©
										},
										
							[30]	=	{
											93,		-- ´Èº½ÆÕ¶É[93]£¨20¼¶£©
										},
										
							[40]	=	{
											385,	-- ÍÆ´°ÍûÔÂ[385]£¨30¼¶£©
											82,		-- ËÄÏóÍ¬¹é[82]£¨30¼¶£©
											89,		-- ÃÎµû    [89]£¨30¼¶£©
										},
										
							[50]	=	{
											86,		-- Á÷Ë®    [86 ]£¨40¼¶£©
										},
										
							[60]	=	{
											92,		-- ·ðÐÄ´ÈÓÓ[92]£¨50¼¶£©
											252,		-- ·ðÐÄ´ÈÓÓ[92]£¨50¼¶£©
											88,		-- ·ðÐÄ´ÈÓÓ[92]£¨50¼¶£©
											91,		-- ·ðÐÄ´ÈÓÓ[92]£¨50¼¶£©
											282,		-- ·ðÐÄ´ÈÓÓ[92]£¨50¼¶£©

										},
							[90]	=	{
										{328, 1, "KiÕm ph¸p"},	-- tam nga tÕ nguyÖt
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp Nga My ph¸i, c¶m phiÒn c¸c s­ tû chØ gi¸o",
		},
		
		{-- ´äÑÌ
			szFacName		=	"cuiyan",	nFacNumb	=	5,	nCamp	=	3,	nRankId	=	67,	nSeries	=	2,
			nTaskId_Fact	=	6,
			nTaskId_90Skill	=	126,
			nTaskId_137		=	137,	nValue_137	=	66,
			tbSkillID = {
							[10]	=	{
											99,		-- ·ç»¨Ñ©ÔÂ[99 ]£¨ÈëÃÅ£©
											102,	-- ·ç¾í²ÐÑ©[102]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											95,		-- ´äÑÌµ¶·¨[95 ]£¨10¼¶£©
											97,		-- ´äÑÌË«µ¶[97 ]£¨10¼¶£©
										},
										
							[30]	=	{
											269,	-- ±ùÐÄÙ»Ó°[269]£¨20¼¶£©
										},
										
							[40]	=	{
											105,	-- Óê´òÀæ»¨[105]£¨30¼¶£©
											113,	-- ¸¡ÔÆÉ¢Ñ©[113]£¨30¼¶£©
										},
										
							[50]	=	{
											100,	-- »¤Ìåº®±ù[100]£¨30¼¶£©
										},
										
							[60]	=	{
											109,	-- Ñ©Ó°    [109]£¨40¼¶£©
											114,	-- Ñ©Ó°    [109]£¨40¼¶£©
											108,	-- Ñ©Ó°    [109]£¨40¼¶£©
											111,	-- Ñ©Ó°    [109]£¨40¼¶£©

										},
							[90]	=	{
										{336, 1, "§ao ph¸p"},	-- b¨ng tung v« ¶nh
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp Thóy Yªn m«n, c¶m phiÒn c¸c s­ tû chØ gi¸o!",
		},
		
		{-- Ø¤°ï
			szFacName		=	"gaibang",	nFacNumb	=	6,	nCamp	=	1,	nRankId	=	78,	nSeries	=	3,
			nTaskId_Fact	=	8,
			nTaskId_90Skill	=	128,
			nTaskId_137		=	137,	nValue_137	=	68,
			tbSkillID		=	{
							[10]	=	{
											122,	-- ¼ûÈËÉìÊÖ[122]£¨ÈëÃÅ£©
											119,	-- ÑØÃÅÍÐ²§[119]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											116,	-- Ø¤°ïÕÆ·¨[116]£¨10¼¶£©
											115,	-- Ø¤°ï°ô·¨[115]£¨10¼¶£©
										},
										
							[30]	=	{
											129,	-- »¯ÏÕÎªÒÄ[129]£¨20¼¶£©
										},
										
							[40]	=	{
											274,	-- ½µÁúÕÆ[274]£¨30¼¶£©
											124,	-- ´ò¹·Õó[124]£¨30¼¶£©
										},
										
							[50]	=	{
											277,	-- »¬²»ÁôÊÖ[277]£¨40¼¶
										},
										
							[60]	=	{
											128,	-- ¿ºÁúÓÐ»Ú[128]£¨50¼¶£©
											125,	-- °ô´ò¶ñ¹·[125]£¨50¼¶£©
											130,	-- °ô´ò¶ñ¹·[125]£¨50¼¶£©
											360,	-- °ô´ò¶ñ¹·[125]£¨50¼¶£©

										},
							[90]	=	{
										{357, 1, "Ch­ëng ph¸p"},	-- Phi long t¹i thiªn
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp C¸i Bang, c¶m phiÒn c¸c tiÒn bèi chØ gi¸o!",
		},
		
		{-- ÌìÈÌ
			szFacName		=	"tianren",	nFacNumb	=	7,	nCamp	=	2,	nRankId	=	81,	nSeries	=	3,
			nTaskId_Fact	=	4,
			nTaskId_90Skill	=	127,
			nTaskId_137		=	137,	nValue_137 = 64,
			tbSkillID		=	{
							[10]	=	{
											135,	-- ²ÐÑôÈçÑª[135]£¨ÈëÃÅ£©
											145,	-- µ¯Ö¸ÁÒÑæ[145]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											132,	-- ÌìÈÌÃ¬·¨[132]£¨10¼¶£©
											131,	-- ÌìÈÌµ¶·¨[131]£¨10¼¶£©
											136,	-- »ð·ÙÁ«»ª[136]£¨10¼¶£©
										},
										
							[30]	=	{
											137,	--»ÃÓ°·Éºü[137]£¨20¼¶£©
										},
										
							[40]	=	{
											141,	-- ÁÒ»ðÇéÌì[141]£¨30¼¶£©
											138,	-- ÍÆÉ½Ìîº£[138]£¨30¼¶£©
											140,	-- ·ÉºèÎÞ¼£[140]£¨30¼¶£©
										},
										
							[50]	=	{
											364,	-- ±¯ËÖÇå·ç[364]£¨40¼¶£©
										},
										
							[60]	=	{
											143,	-- À÷Ä§¶á»ê[143]£¨50¼¶£©
																						143,	-- À÷Ä§¶á»ê[143]£¨50¼¶£©
											150,	-- À÷Ä§¶á»ê[143]£¨50¼¶£©
											142,	-- À÷Ä§¶á»ê[143]£¨50¼¶£©
											148,	-- À÷Ä§¶á»ê[143]£¨50¼¶£©
										},
							[90]	=	{
										{362, 1, "§ao ph¸p"},	-- Thiªn ngo¹i l­u tinh
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp Thiªn NhÉn gi¸o, b¸i kiÕn c¸c s­ huynh s­ tû!",
		},
		
		{-- Îäµ±
			szFacName		=	"wudang",	nFacNumb	=	8,	nCamp	=	1,	nRankId	=	73,	nSeries	=	4,
			nTaskId_Fact	=	5,
			nTaskId_90Skill	=	129,
			nTaskId_137		=	137,	nValue_137	=	65,
			tbSkillID		=	{
							[10]	=	{
											153,	-- Å­À×Ö¸  [153]£¨ÈëÃÅ£©
											155,	-- ²×º£Ã÷ÔÂ[155]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											152,	-- Îäµ±È­·¨[152]£¨10¼¶£©
											151,	-- Îäµ±½£·¨[151]£¨10¼¶£©
										},
										
							[30]	=	{
											159,	-- ÆßÐÇÕó  [159]£¨30¼¶£©
										},
										
							[40]	=	{
											164,	-- °þ¼°¶ø¸´[164]£¨30¼¶£©
											158,	-- ½£·É¾ªÌì[158]£¨30¼¶£©
										},
										
							[50]	=	{
											160,	-- ÌÝÔÆ×Ý  [160]£¨40¼¶£©
										},
										
							[60]	=	{
											157,	-- ×øÍûÎÞÎÒ[157]£¨50¼¶£©
											166,	-- ×øÍûÎÞÎÒ[157]£¨50¼¶£©
											165,	-- ×øÍûÎÞÎÒ[157]£¨50¼¶£©
											267,	-- ×øÍûÎÞÎÒ[157]£¨50¼¶£©

										},
							[90]	=	{
										{365, 1, "QuyÒn ph¸p"},	-- thiªn ®Þa v« cùc
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp Vâ §ang ph¸i, tham kiÕn c¸c s­ huynh s­ tû!",
		},
		
		{-- À¥ÂØ
			szFacName		=	"kunlun",	nFacNumb	=	9,	nCamp	=	3,	nRankId	=	75,	nSeries	=	4,
			nTaskId_Fact	=	9,
			nTaskId_90Skill	=	130,
			nTaskId_137		=	137,	nValue_137	=	69,
			tbSkillID		=	{
							[10]	=	{
											169,	-- ºô·ç·¨  [169]£¨ÈëÃÅ£©
											179,	-- ¿ñÀ×ÕðµØ[179]£¨ÈëÃÅ£©
										},
										
							[20]	=	{
											167,	-- À¥ÂØµ¶·¨[167]£¨10¼¶£©
											168,	-- À¥ÂØ½£·¨[168]£¨10¼¶£©
											392,	-- ²ø×Ö¾÷[392]£¨10¼¶£©
											171,	-- Çå·ç·û  [171]£¨10¼¶£©
										},
										
							[30]	=	{
											174,	-- î¿°í·û  [174]£¨20¼¶£©
										},
										
							[40]	=	{
											178,	-- Ò»ÆøÈýÇå[178]£¨30¼¶£©
											172,	-- Ñ¸À×Öä  [172]£¨30¼¶£©
											393,	-- È±ÉÙID£¨30¼¶£©
											173,	-- ÌìÇåµØ×Ç[173]£¨30¼¶£©
										},
										
							[50]	=	{
											175,	-- ÆÛº®°ÁÑ©[175]£¨40¼¶£©
											181,	-- ÆúÐÄ·û  [181]£¨40¼¶£©
										},
										
							[60]	=	{
											176,	-- ¿ñ·çÖèµç[176]£¨50¼¶£©
											90,		-- ÃÔ×Ù»ÃÓ°[90 ]£¨50¼¶£©
											275,		-- ÃÔ×Ù»ÃÓ°[90 ]£¨50¼¶£©
											182,		-- ÃÔ×Ù»ÃÓ°[90 ]£¨50¼¶£©
											630,

										},
							[90]	=	{
										{372, 1, "§ao ph¸p"},	-- °Ng¹o tuyÕt tiªu phong
									},
										
							
						},
			szMsg = "KÓ tõ h«m nay, %s gia nhËp C«n L«n ph¸i, b¸i kiÕn c¸c vÞ ®¹o huynh!",
		},
        {
            -- Á÷ÅÉÃû£¬Á÷ÅÉ±àºÅ£¬Á÷ÅÉÕóÓª£¬³öÊ¦³ÆºÅ£¬Á÷ÅÉÎåÐÐ
            szFacName = "huashan", nFacNumb = 10, nCamp = 3, nRankId = 89, nSeries = 2,

            nTaskId_Fact    = 3481, -- ÃÅÅÉÈÎÎñ±äÁ¿
            nTaskId_90Skill	= 3486, -- 90¼¼ÄÜÈÎÎñ±äÁ¿
            nTaskId_137     = 137 , -- ³öÊ¦ÈÎÎñ±äÁ¿
            nValue_137      = 71  , -- ³öÊ¦ÈÎÎñ±äÁ¿Öµ
            nJinjieSkillID  = 1370, -- ½ø½×¼¼ÄÜ(ºÆÈ»Ö®Æø)

            -- ÃÅÅÉ¼¼ÄÜ±í
            tbSkillID =
            {
                [10] =
                {
                    1347,	-- °×ºç¹áÈÕ(ÈëÃÅ)
                    1372,	-- Çå·çËÍË¬(ÈëÃÅ)
                },						
                [20] =
                {
                    1349,	-- ½£×Ú×Ü¾÷(10¼¶)
                    1374,	-- ÁúÈÅÉí  (10¼¶)
                },						
                [30] =
                {
                    1350,	-- ÑøÎá½£·¨(20¼¶)
                    1375,   -- º£ÄÉ°Ù´¨(20¼¶)
                },						
                [40] =
                {
                    1351,	-- ½ðÑãºá¿Õ(30¼¶)
                    1376,	-- ÁúÐý½£Æø(30¼¶)
                },						
                [50] =
                {
                    1354,	-- Ï£ÒÄ½£·¨(40¼¶)
                    1378,	-- ÆøÕðÉ½ºÓ(40¼¶)
                },
                [60] =
                {
                    1355,	-- ÌìÀ¤µ¹Ðü(50¼¶)
                    1379,	-- Æø¹á³¤ºç(50¼¶)
                },				
                [90]	=	{
								  {1364, 1, "Hoa S¬n KiÕm T«ng"},	-- ¶áÃüÁ¬»·ÈýÏÉ½£(90¼¶)
							},		

            },
            szMsg = "%s b¾t ®Çu tõ h«m nay gia nhËp ph¸i Hoa S¬n, ®Õn gÆp vµ b¸i kiÕn c¸c vÞ s­ huynh, xin c¸c vÞ chiÕu cè!",
        },
	}


	 tbAwardItem = 
	{	
		{szName = "Than hanh phu", tbProp={6,1,1266,1,0,0,0}, nCount=1,nExpiredTime=1440*7,nBindState = -2},
		{szName = "Thæ ®Þa phï", tbProp={6,1,438,1,0,0,0}, nCount=1,nExpiredTime=1440*7,nBindState=-2},
	}
